{
    "courseCode": "M3004",
    "courseName": "Biomedical Science Advanced",
    "courseType": "Bachelor degree (honours)",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces the student to the chemistry of organic molecules and the biochemistry of cells. We examine the role of functional groups in biological molecules of biomedical importance and common reactions in metabolism. We reinforce concepts of ionisation and pH. We discuss the chemistry of proteins and their physical properties in solution leading up to an examination of enzyme catalysis and kinetics. This lays the foundation for an examination of the biological oxidation of fats and carbohydrates that provides the cell with energy. We examine the way energy is stored in times of plenty and relate our understanding to normal and disease states that occur.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "BMS1011",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Biomedical chemistry"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces the student to the fundamental units of life (the cells) and explores how cells come together to form primary tissues which subsequently combine to form the organ systems and ultimately the living organism.Cellular structure and metabolism is studied including the chemical constituents of living cells and the biological reactions that take place in them. Basic developmental biology concepts associated with the patterning of the body plan and embryological origins of cells and tissues are introduced.The unit also introduces students to the microbial world and explores the structure and function of the immune system and how the body develops an immune response.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "BIO1011, BIO1022.",
                    "SCABand": 3,
                    "UnitCode": "BMS1021",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Cells, tissues and organisms"
                },
                {
                    "CreditPoints": 6,
                    "Description": "The behaviour of human and biomedical systems are understood in terms of underlying physical principles. Forces involved in human movement and body systems including muscles and joints. Energy and heat flow and metabolism, pressure, osmosis, diffusion and respiration, fluid flow in the cardiovascular system. Electrical charges, current, potential and capacitance in simple circuits, EEG, ECG, cells and nerve conduction. Sound and ultrasound, human hearing, refraction and lenses, the human eye, optical and electron microscopes. X-rays and radiation, biological effects and damage, radiation therapy and medical imaging.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "PHS1031, PHS1080.",
                    "SCABand": 3,
                    "UnitCode": "BMS1031",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Medical biophysics"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Gene structure and function, including the genetic code and its interpretation, the assembly of genes and chromosomal organisation, and the basics of the genetic flow of information from DNA to RNA to protein. Mechanisms of gene expression and regulation, gene replication and repair, and the causes and implications of genetic mutations. Molecular genetics and recombinant DNA technology for the manipulation of genes. Genomics and its applications in medicine and principles of gene therapy.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "MCB2011, MOL2011.",
                    "SCABand": 3,
                    "UnitCode": "BMS1062",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Molecular biology"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit consists of an introduction to human nervous system which ranges in scope from the operations of individual nerve cells at the molecular level to the generation of complex cognitive behaviours. The unit will provide students with an essential overview of the human nervous system and it will also serve as a foundation for more specialised studies in neurobiology or cognitive science.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "PHY2011.",
                    "SCABand": 3,
                    "UnitCode": "BMS1052",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Human neurobiology"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Applications of epidemiological and statistical concepts and methods to typical problems in population health and in the biomedical literature. This will include consideration of fundamental ethical issues pertaining to the conduct of biomedical research and population health interventions. Much emphasis is placed on a population view of health and disease, social determinants of health, epidemiological principles, research study design and statistical analyses of data.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "BMS1042",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Public health and preventive medicine"
                }
            ],
            "year": 2017
        },
        {
            "code": "S1-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This course is an introduction to human anatomy. It includes an overview of  general principles of major body systems. This will be followed by a consideration of specific areas of regional anatomy from an evolutionary perspective. Namely, what distinguishes the human body from other primates, mammals and indeed vertebrates and how have these adaptations of anatomy contributed in a functional context to us being so successful.  Practical classes will involve exposure to human cadaver prosections, skeletal material, models and a range of imaging modalities including X-rays, CT scans etc.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "ANT2331.",
                    "SCABand": 3,
                    "UnitCode": "BMS2011",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Structure of the human body: An evolutionary and functional perspective"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit covers the molecular principles of cellular metabolic regulation, metabolic interrelationship of tissues, molecular events associated with the fed and fasted states, and the generation of metabolic energy by oxidation of macronutrients.It discusses hormone action and the molecular and cellular basis of diseases, and gives an overview of tissue metabolism.The autonomic control of energy, exercise and metabolism, and how drugs can modulate these processes will be considered and discussed.The unit will also  cover the molecular mechanism of cell growth, differentiation and death, and introduces the basic principles of developmental biology covering cell fate, pattern formation and tissue morphogenesis during embryonic life.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "BMS1011.",
                    "Prohibitions": "BCH2022",
                    "SCABand": 3,
                    "UnitCode": "BMS2021",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Human molecular cell biology"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Physiology is the study of how living organisms work. It involves the functions of cells, tissues, organs and the whole organism. This unit will provide you with an overview of how the body maintains a constant environment for its cells and tissues through the integrated functions of the following physiological systems: cardiovascular, renal, endocrine, respiratory, reproductive and gastrointestinal. You will also consider how the body adapts to changes in the external environment and to disease states.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "BMS1052.",
                    "Prohibitions": "BND2011, PHY2011, PHY2021 and PHY2032.",
                    "SCABand": 3,
                    "UnitCode": "BMS2031",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Body systems"
                }
            ],
            "year": 2018
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces the basic genetic principles underlying modern human genetics. Topics include: the central role of genes in the inheritance of traits, and the complex variation in inheritance patterns that arise due to interactions of genes with each other and the environment; the identification, characterisation and mapping of human genes;  the value of model organisms in genetics; chromosome variation and its role in both evolution and human disease; how genes function and how genetic malfunction can lead to genetic disease; how an understanding of such diseases at the genetic level may assist in diagnosis, prevention and therapy; the genetic control of development; genetic counselling and calculating risk for genetic diseases; human evolutionary genetics.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "BMS1062 or MCB2011/MOL2011",
                    "Prohibitions": "GEN2041 and GEN2052.",
                    "SCABand": 3,
                    "UnitCode": "BMS2042",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Human genetics"
                },
                {
                    "CreditPoints": 6,
                    "Description": "The following aspects of the interactions of microbes with their hosts will be presented in lectures, tutorials, discussion groups and videos: The history of infectious diseases, medically important viruses and bacteria, pathogenic mechanisms in infectious diseases, immunity to infection, and their regulation, control of infection by vaccines and drugs, and emerging diseases.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "BMS1062.",
                    "Prohibitions": "MIC2022.",
                    "SCABand": 3,
                    "UnitCode": "BMS2052",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Microbes in health and disease"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Bioinformatics unites the major advances in biology, biochemistry and the biomedical sciences with those in computing, bioinformatics and networking. The unit covers the application of the internet to biomedical sciences; organisation and uses of scientific databases; use of computational methods in genomics and proteomics; fundamentals of molecular modelling; analysis and presentation of biomedical data; and communication of biomedical data using information technology.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "MOL2022.",
                    "SCABand": 3,
                    "UnitCode": "BMS2062",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to bioinformatics"
                }
            ],
            "year": 2019
        },
        {
            "code": "S1-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 12,
                    "Description": "This unit will provide insights into the molecular mechanisms that mediate human diseases and the specific biotechnologies used to facilitate diagnosis and treatment.Relevant areas studied in this unit may change from year to year but will generally include a number of topics related to pharmacology, cancer, cardiovascular disease, development and stem cells, infection and immunity, metabolic disease and obesity, and neuroscience.The small group work in the unit is designed to build employability skills for graduates.Emphasis is placed on critical thinking, research skills and on communication skills in the context of biomedical research.",
                    "EFTSL": 0.25,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "BMS1011, BMS1021, BMS1031, BMS1042, BMS1052, BMS1062, BMS2011, BMS2021, BMS2031, BMS2042, BMS2052, BMS2062.",
                    "Prohibitions": "BMS3021.",
                    "SCABand": 3,
                    "UnitCode": "BMS3031",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Molecular mechanisms of disease"
                }
            ],
            "year": 2020
        },
        {
            "code": "S1-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 36,
                    "Description": "Students undertake a supervised research project involving research of a publishable standard which forms the basis of a thesis presented at the end of the year. As part of the unit students present seminars on their research, and are trained in advanced scientific techniques. Students take part in an oral review of the thesis report. Candidates may commence the Honours year at the beginning of either the first or second semester.",
                    "EFTSL": 0.75,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "A distinction level average in 24 credit points at third year level, including at least 12 points in 3rd year BMS units.",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "BMS4100",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Full year 2017 (Day)",
                                "Second semester 2017 to First semester 2018 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Biomedical science research project"
                }
            ],
            "year": 2022
        },
        {
            "code": "S2-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2023
        }
    ]
}