{
    "courseCode": "A2001",
    "courseName": "Global Studies",
    "courseType": "Bachelor degree",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to interdisciplinary approaches to addressing the key challenges facing the global community. Students are introduced to historical and contemporary concepts, ideas, and frameworks necessary for critically reflecting on the impact of globalisation across cultures. Key to this reflection will be the development of skills in understanding institutions, cultures and people across a range of local, regional, and global contexts. The unit will enable students to identify, define and describe key global challenges and to apply the interdisciplinary knowledge gained in this unit  to critique and construct knowledge in this area.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Arts",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "ATS1020",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Leadership for social change 1"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit is designed to give you the historical background and conceptual tools to understand the contemporary world. It traces the key political, economic, and social developments since 1945 that have brought us to where we are today.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Arts",
                    "Prerequisites": "",
                    "Prohibitions": "AZA1325",
                    "SCABand": 1,
                    "UnitCode": "ATS1325",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Contemporary worlds 1"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit takes an interdisciplinary approach to introducing students to a selection of the most pressing issues facing the contemporary world. It is divided into three main sections: economics; politics; society. Topics include, for example, global finance, post-Cold War conflict, environmental change, and migration.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Arts",
                    "Prerequisites": "",
                    "Prohibitions": "AZA1326",
                    "SCABand": 1,
                    "UnitCode": "ATS1326",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Contemporary worlds 2"
                }
            ],
            "year": 2016
        },
        {
            "code": "S1-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "In this unit students will build on the work of Leadership for Social Change 1. Students will compare and contrast a range of solutions to global challenges in different historical, linguistic, cultural, and geographical settings, focusing especially on developing an understanding of effective leadership across a range of contexts. They will develop the skills necessary to critically engage with a range of sources that theorise and reflect on leadership, drawing on a variety of disciplinary approaches. In the workshops students will be encouraged reflect on, then critically engage with, specific examples of successful social change.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Arts",
                    "Prerequisites": "ATS1020",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "ATS2086",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Leadership for social change 2"
                }
            ],
            "year": 2017
        },
        {
            "code": "S2-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2017
        },
        {
            "code": "S1-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2018
        },
        {
            "code": "S2-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 12,
                    "Description": "This unit builds on the foundations of the Leadership for Social Change 1 and 2. Working through problem-based learning scenarios, students will be expected to demonstrate their knowledge of forms of leadership and their link to addressing questions of global challenges and the drivers of social change. The unit will provide a forum in which students will bring together both discipline-specific and interdisciplinary skills that they have acquired over their study. Students will build on the synthesising of this knowledge to formulate practical and innovative approaches to global challenges.",
                    "EFTSL": 0.25,
                    "Faculty": "Faculty of Arts",
                    "Prerequisites": "ATS2086",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "ATS3111",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Leadership for social change 3"
                }
            ],
            "year": 2018
        }
    ]
}