{
    "courseCode": "B2003",
    "courseName": "Business Specialist",
    "courseType": "Bachelor degree",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Liability for defective products; liability for misleading advice or information; contract law; agency law; partnership law; introduction to company law; company officers' duties.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students enrolled in course code 0816 must be granted permission to undertake this unit.",
                    "Prohibitions": "BTB1010, BTP1010, BTC1110, BTG1200, BTW1200",
                    "SCABand": 3,
                    "UnitCode": "BTF1010",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Business law"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit provides students with an introduction to financial accounting guided by the Conceptual Framework and Accounting Standards. Emphasis is placed on accounting processes, practices and policies that enable the financial statements to be prepared. Students will integrate theoretical and technical knowledge learned and exercise judgement to explore accounting issues.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "ACB1002, AFF1121, ACF1121, AFG1002, ACG1002, AFC1030, AFW1002, ACW1002, ACC1100, ACP1100.",
                    "SCABand": 3,
                    "UnitCode": "ACF1100",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to financial accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Economics as an area of knowledge. Economics in a business degree. Understanding economic policy. An analysis of markets: supply and demand; consumer behaviour; firm behaviour; cost of production and profit maximisation; behaviour of firms in different market structures; evaluation of market capitalist economic systems, economic efficiency, market failure, government failure; current economic policies, competition policy, privatisation and the funding of education.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "ECB1101, ECC1000, ECG1101, ECP1100, ECS1101, ECW1101, PMM2020",
                    "SCABand": 3,
                    "UnitCode": "ECF1100",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Microeconomics"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Students will learn to use basic statistical techniques and apply them to problems in accounting, finance, management, marketing and business in general. Students should also be able to effectively communicate the results of their analyses. This unit covers descriptive statistics for revealing the information contained in data; probability as a tool for dealing with uncertainty; probability distributions to model business behaviour; confidence interval estimation and hypothesis testing techniques for single populations; analysis of relationships between variables using simple linear regression; and simple tools for forecasting time series data. Excel software will be used.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "ETX1100, BUS1100, ETB1100, ETC1000, ETG1102, ETW1000, ETW1102, PMM2020, SCI1020, ETP1100, ETX9000, AFX9510, ETC9000, ETX9000 and students enrolled in course codes 1941, 2224, 3381 or 4423 cannot undertake this unit.",
                    "SCABand": 2,
                    "UnitCode": "ETF1100",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Business statistics"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "As a foundation, this unit introduces students to the concepts of finance, financial mathematics, investment analysis, the financial system, risk management and the relationship of finances to other commercial disciplines.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "AFC1100, AFC2000, AFC2100, AFG1300, AFW1300, BFB1300, BFC2000, BFF1300, BFG1300, BFW1300,BFC1001, BFB1001, BFP1001, BFW1001",
                    "SCABand": 3,
                    "UnitCode": "BFF1001",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Foundations of finance"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Topics include the separate legal entity status of companies and the concept of limited liability; the effect of registration; the corporate constitution; the company's relationship with outsiders; corporate management incorporating extensive consideration of directors' duties; share capital; regulation of public fund raising; members' remedies incorporating statutory remedies and common law rights of action; members' meetings; forms of corporate insolvency administrations.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "BTF1010, BTC1110 or BTP1010",
                    "Prohibitions": "BTB2220, BTC2210, BTF2220, BTG2220, BTW2220",
                    "SCABand": 3,
                    "UnitCode": "BTX2000",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Corporations law"
                }
            ],
            "year": 2016
        },
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This introductory management accounting unit focuses on the types of cost information that can be produced to assist managers and other employees within organisations in planning and control, and in decision-making. Topics include: costs and cost behaviour, product costing, cost allocation techniques, cost-volume-profit analysis, and the use of cost information for management decisions.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed one of the following units: ACF1100, ACF1121, AFF1121, ACP1100.",
                    "Prohibitions": "ACB2020, AFC2131, ACC2131, AFG2020, ACG2020, AFW2020, ACW2020, AFF2391, ACF2391, ACC2200.",
                    "SCABand": 3,
                    "UnitCode": "ACF2200",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to management accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "At the core of Accounting Information Systems is the idea that accountants must understand the core business processes that underpin the business activities in an organisation and generate transaction data. Thus, the objective of this unit is to provide students with a broad introduction to the core business processes.Further, given the role technology plays in accounting, with many accounting systems being computerised, other topics covered include: how hardware, software and human processes turn data into useful financial and non-financial information for decision making, methods for documenting and analysing business processes, principles of effective spreadsheet design, systems development and maintenance, and the need to understand internal controls in order to ensure (information and other) resources remain secure from losses through both inadvertent and malicious actions.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed one of the following units:  AFF1000, ACF1000, AFP1000, ACB1000, ACP1000, ACC1000, AFC1000, ACF1100, ACC1100, ACP1100, ACC1200, ACP1200, ACF1200, ACW1100, ACW1200.",
                    "Prohibitions": "ACB2851, ACC2851, ACF2851, ACG2851, ACP2851, ACW2851, BUS1060, BUS3030, AFF2851, AFC2851, AFW2851, AFP2851, ACC2400.",
                    "SCABand": 3,
                    "UnitCode": "ACF2400",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Accounting information systems"
                }
            ],
            "year": 2017
        },
        {
            "code": "S2-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit examines financial accounting issues associated with the operation of corporate structures. Topics include financial reporting requirements, financing company operations, business combinations, the nature of corporate groups, the preparation of consolidated financial statements and financial statement analysis.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed one of the following units: ACF1121, AFF1121, ACF1100, ACP1100.",
                    "Prohibitions": "ACB2491, AFF2491, ACF2491, AFG2491, ACG2491, AFW2491, ACW2491, ACC2120, AFC2120, ACC2100.",
                    "SCABand": 3,
                    "UnitCode": "ACF2100",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Financial accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit explores a range of techniques used to analyse corporate financial performance and valuation of entities. These include: application and use of financial ratios and forecasting techniques, accounting-based and cash flow-based share valuation, credit analysis and financial distress prediction, equity security analysis, and analysis relating to mergers and takeovers. Both Australian and international case studies are used to provide a real-world context.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed one of the following units: BFC1001, BFF1001, AFC2140, BFC2140, BFF2140 PLUS one of the following units: AFF1121, ACC1030, ACF1100, ACC1100, ACF2100, ACC2100",
                    "Prohibitions": "AFC3230, AFC3234, ACC3230.",
                    "SCABand": 3,
                    "UnitCode": "ACX3150",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Financial analysis and valuation"
                }
            ],
            "year": 2017
        },
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit focuses on the provision and use of management accounting information for management planning and control in organisations. Technical and behavioural issues related to budgeting, variance analysis, performance measurement, and value chain management are considered.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have completed one of the following units: AFF2391, ACF2391, ACF2200",
                    "Prohibitions": "ACC3131, AFC3131, ACF3431, AFF3431, ACB3021, AFW3021, ACW3021, AFG3021, ACG3021, ACC3200",
                    "SCABand": 3,
                    "UnitCode": "ACF3200",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Management accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit encompasses the nature and purpose of audit and assurance services, and the regulatory and professional environment in which they operate. Students apply professional, ethical and legal requirements stemming from the assurance framework and applicable auditing pronouncements to 'real world' scenarios.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed one of the following units: AFF2491, ACF2491, ACF2100",
                    "Prohibitions": "ACF3631, AFF2631, ACC3160, AFC3160, ACB3041, AFW3041, ACW3041, AFG3041, ACG3041, ACC3600",
                    "SCABand": 3,
                    "UnitCode": "ACF3600",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Auditing and assurance"
                }
            ],
            "year": 2018
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit explores advanced financial accounting issues, building on knowledge and skills gained in earlier units in financial accounting. A range of theories used to assess accounting decisions, reporting practices and regulation are examined. The unit focuses on a number of contemporary accounting issues including: measurement, intangible assets, financial instruments, foreign currency transactions and integrated reporting.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed one of the following units: AFF2491, AFC2491, ACC2100.",
                    "Prohibitions": "ACB3050, AFF3491, ACF3491, AFG3040, ACG3040, AFC3120, ACC3120, AFG3050, ACG3050, AFW3040, ACW3040, AFW3050, ACW3050, ACC3200",
                    "SCABand": 3,
                    "UnitCode": "ACF3100",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Advanced financial accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Assessable income and exempt income; deductions; capital gains tax; fringe benefits tax; goods and services tax; residence and source; individual offsets.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "BTF1010",
                    "Prohibitions": "BTB3221, BTC3150, BTG3221, BTW3221",
                    "SCABand": 3,
                    "UnitCode": "BTF3931",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Trimester A 2017 (Day)",
                                "Trimester B 2017 (Day)",
                                "Trimester C 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Taxation law"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This capstone unit integrates prior learning gained throughout the Bachelor of Accounting course and prepares students for transition to a professional career and for undertaking postgraduate studies. Students will be required to analyse, synthesise, critically evaluate, and apply knowledge and skills acquired over the course of their studies to real-world scenarios. Students will also be required to reflect on the role of accounting in organisations and society more generally, and will develop professional judgement, as well as the key skills that are expected of accountants.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have completed the following five units:ACF1100, ACF2100, ACF2200, ACF2400, and ACF3200.",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "ACF3900",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Global issues in accounting"
                }
            ],
            "year": 2018
        }
    ]
}