{
    "courseCode": "B2007",
    "courseName": "Business Administration",
    "courseType": "Bachelor degree",
    "teachingPeriods": [
        {},
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit provides students with an introduction to financial accounting guided by the Conceptual Framework and Accounting Standards. Emphasis is placed on accounting processes, practices and policies that enable the financial statements to be prepared. Students will integrate theoretical and technical knowledge learned and exercise judgement to explore accounting issues.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "ACB1002, AFF1121, ACF1121, AFG1002, ACG1002, AFC1030, AFW1002, ACW1002, ACC1100, ACF1100, ACP1100, ACW1100",
                    "SCABand": 3,
                    "UnitCode": "ACB1100",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to financial accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "An introduction to the study of economics; consumer behaviour; demand and supply and the operation of markets; market efficiency and welfare; welfare effects of international trade; public sector economics; the behaviour of firms and the organisation of an industry; market structures - perfect competition and monopoly; economies of the labour market.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "ECF1100, ECG1101, ECP1100, ECW1101, ECS1101",
                    "SCABand": 3,
                    "UnitCode": "ECB1101",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introductory microeconomics"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit offers a critical introduction to fundamental questions in the discipline of management. What is management? What do managers do, and how do I become a good manager? What are the effects of management practice on employees and their experience of being managed? Key contemporary issues of globalisation and cultural diversity, ethics and social responsibility affect the answers to these questions and are therefore woven throughout the curriculum. The unit draws upon a range of sources - academic, practical, popular cultural - to engage students in multiple ways of knowing about management.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "MGC1010, MGF1010, MGG1010, MGP1010, MGW1010",
                    "SCABand": 3,
                    "UnitCode": "MGB1010",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to management"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Principles of marketing introduces students to the broad discipline of marketing. It encompasses marketing's role in a dynamic business environment and introduces students to the concepts and strategies employed by marketers. The aim of the unit is to provide students with the conceptual skills necessary to identify and solve marketing problems. The unit provides a foundation for those students seeking to pursue further study in marketing; however it covers the broad scope of marketing for those students undertaking only one marketing unit.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "MKC1200, MKF1120, MKW1120, MKG1120, MKP1120",
                    "SCABand": 3,
                    "UnitCode": "MKB1200",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Principles of marketing"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Liability for defective products; liability for misleading advice or information; contract law; agency law; partnership law; introduction to company law; company officers' duties.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students enrolled in course code 0816 must be granted permission to undertake this unit.",
                    "Prohibitions": "BTC1110, BTG1200, BTW1200, BTF1010, BTP1010",
                    "SCABand": 3,
                    "UnitCode": "BTB1010",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Commercial Law"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Introduction to spreadsheeting. Descriptive statistics. Elementary probability. Discrete and continuous probability distributions. Statistical inference. Simple linear regression and correlation. Forecasting and time series. Index numbers.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "BUS1100, PMM2020, ETC1000, ETG1102, ETW1000, ETX1100, SCI1020, STA1010, ETW1102",
                    "SCABand": 3,
                    "UnitCode": "ETB1100",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Business statistics"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit is designed to develop students' awareness of current theoretical perspectives on and of empirical evaluations of organisational initiatives designed to foster wellbeing at both the individual and organisational level. The unit will provide a macro-level framework for examining an organisation's social, ethical and environmental responsibility, followed by an examination of organisational level approaches to wellness including work/life initiatives and OH&S initiatives. At the micro-level the unit will address strategies the individual employees may use to manage their own state of wellness.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed MGP1010 or MGF1010 or MGW1010 or MGB1010 or MGG1010 before undertaking this unit.",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MGW3210",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Organisational wellness"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Tourism marketing provides students with a broad understanding of how key marketing concepts and theories can be applied to the tourism sector.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MKB1200 or MKP1120",
                    "Prohibitions": "MKP2600, MKW2600",
                    "SCABand": 3,
                    "UnitCode": "MKB2600",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Tourism marketing"
                }
            ],
            "year": 2017
        },
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Students gain an understanding of factors affecting the behaviour of people in work settings. The unit focuses on individual, group, and total organisational human factors influencing the effectiveness of organisations including: the nature of organisations in the global context; individual behaviour including perception, attitudes, values and personality, motivation and performance; group behaviour in organisations including the properties and management of groups, leaders and leadership, organisational power, influence, communication, conflict and decision making; organisational structure; organisational culture; change; the formal and informal organisation.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MGB1010 or MGC1010 or MGF1010 or MGG1010 or MGP1010 or MGW1010",
                    "Prohibitions": "MGC2230, MGF2111, MGG2230, MGW2230",
                    "SCABand": 3,
                    "UnitCode": "MGB2230",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Organisational behaviour"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Analysis of the strategic role of HRM in organisations, human resource planning, job design, staffing, performance management, training and development, reward systems, legal issues in employment, HR information systems, and the contribution of HRM to competitive advantage.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MGB1010 or MGC1010 or MGF1010 or MGG1010 or MGP1010 or MGW1010",
                    "Prohibitions": "MGC2430, MGF2661, MGG2430, MGW2430",
                    "SCABand": 3,
                    "UnitCode": "MGB2430",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Human resource management"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Consumer behaviour explores the internal psychological factors that influence consumers in both the B2C and B2B contexts. It also provides a broad understanding of the potential for external social factors to influence the purchase decisions and behaviours of consumers. The concepts covered in this unit offer insight into the ways in which organisational strategies and tactics are shaped by two-way dialogue with consumers.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MKB1200",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MKB2402",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Consumer behaviour"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Marketing research provides students with a broad understanding of the entire marketing research process. This includes understanding the marketing research decision process, research design, sampling, data collection, data analysis and how to prepare a marketing research proposal and report.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MKB1200",
                    "Prohibitions": "MKP2720",
                    "SCABand": 3,
                    "UnitCode": "MKB2420",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Marketing research methods"
                }
            ],
            "year": 2017
        },
        {
            "code": "S2-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces the students to retailing from a management perspective. This includes the evolution of retailing; retail organisations and their structure; retail environment and the challenges; formulating and implementing retail strategy; merchandise management; retail pricing and communication mix; transportation and logistics; customer service; store location, layout and presentation; retail performance measurement.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MKB1200",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MKB2500",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Retail management principles"
                },
                {
                    "CreditPoints": 6,
                    "Description": "A brand is much more than a logo, a symbol, a sign or device, or simply the result of clever advertising. It helps to communicate value and create and deliver that value. Branding is a promise of value for customers. It helps to attract and, if it is true and accurate, keep customers. It provides an extra element of understanding or meaning, for customers as they form opinions and make purchase decisions from a variety of competing offerings. There is strong industry demand for graduates with a thorough understanding of branding. While this unit is primarily for students undertaking a major in marketing it is offered to any student with a prerequisite of an introductory marketing unit.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MKB1200",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MKB2521",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Brand management"
                }
            ],
            "year": 2018
        },
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "The primary aim of this unit is to explore the use of marketing communication to build and sustain brands, based on knowledge of how communication works; the institutions which participate in the process and practical business processes necessary to achieve and measure defined communication goals. In particular, students will be able to understand the integrated nature of communication and develop a full appreciation of advertising, sales promotion, public relations, publicity and direct marketing in a digital and contemporary environment.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MKB2402",
                    "Prohibitions": "MKC3460, MKF3461, MKG2460, MKW2460",
                    "SCABand": 3,
                    "UnitCode": "MKB3461",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Marketing communication"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Services marketing provides students with a broad understanding of the application of marketing concepts and theories to the services sector. This includes understanding service design and delivery, customer service, service quality measurement and internal marketing.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MKB1200",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MKB3301",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Services Marketing"
                }
            ],
            "year": 2018
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Business environments including markets, critical success factors, and strategies employed to gain a competitive advantage; the nature of strategic management; the analysis and interpretation of business environments; the nature of competition, relative position of firms, individual strategies and their relationship to critical success factors; strengths and weaknesses related to production, logistics, finance, research and development, marketing, administration etc.; the role of structure, controls, rewards, culture and leadership in implementation.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MGB1010 or MGC1010 or MGF1010 or MGG1010 or MGP1010 or MGW1010 and 96 credit points.",
                    "Prohibitions": "MGP3684, MGC3110, MGW3401, MGF3401, MGG3401",
                    "SCABand": 3,
                    "UnitCode": "MGB3684",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Business strategy"
                },
                {
                    "CreditPoints": 6,
                    "Description": "International marketing explores the application of marketing concepts and theories to the international environment. It also provides a broad understanding of how economic, political, geographic, demographic, cultural and other international factors influence marketing strategy. The concepts covered in this unit offer insight into the relative value of alternative marketing strategies in different international markets.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MKB3531",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "International marketing"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Digital marketing explores different aspects of the digital landscape and how to integrate digital technologies into the marketing mix. It also provides a broad understanding of the various digital marketing tools, and the application of these tools in the rapidly changing digital environment.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MKB1200",
                    "Prohibitions": "MKF3881",
                    "SCABand": 3,
                    "UnitCode": "MKB3881",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Digital marketing"
                }
            ],
            "year": 2019
        }
    ]
}