{
    "courseCode": "B2007",
    "courseName": "Business Administration",
    "courseType": "Bachelor degree",
    "teachingPeriods": [
        {},
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit provides students with an introduction to financial accounting guided by the Conceptual Framework and Accounting Standards. Emphasis is placed on accounting processes, practices and policies that enable the financial statements to be prepared. Students will integrate theoretical and technical knowledge learned and exercise judgement to explore accounting issues.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "ACB1002, AFF1121, ACF1121, AFG1002, ACG1002, AFC1030, AFW1002, ACW1002, ACC1100, ACF1100, ACP1100, ACW1100",
                    "SCABand": 3,
                    "UnitCode": "ACB1100",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to financial accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "An introduction to the study of economics; consumer behaviour; demand and supply and the operation of markets; market efficiency and welfare; welfare effects of international trade; public sector economics; the behaviour of firms and the organisation of an industry; market structures - perfect competition and monopoly; economies of the labour market.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "ECF1100, ECG1101, ECP1100, ECW1101, ECS1101",
                    "SCABand": 3,
                    "UnitCode": "ECB1101",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introductory microeconomics"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit offers a critical introduction to fundamental questions in the discipline of management. What is management? What do managers do, and how do I become a good manager? What are the effects of management practice on employees and their experience of being managed? Key contemporary issues of globalisation and cultural diversity, ethics and social responsibility affect the answers to these questions and are therefore woven throughout the curriculum. The unit draws upon a range of sources - academic, practical, popular cultural - to engage students in multiple ways of knowing about management.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "MGC1010, MGF1010, MGG1010, MGP1010, MGW1010",
                    "SCABand": 3,
                    "UnitCode": "MGB1010",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to management"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Principles of marketing introduces students to the broad discipline of marketing. It encompasses marketing's role in a dynamic business environment and introduces students to the concepts and strategies employed by marketers. The aim of the unit is to provide students with the conceptual skills necessary to identify and solve marketing problems. The unit provides a foundation for those students seeking to pursue further study in marketing; however it covers the broad scope of marketing for those students undertaking only one marketing unit.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "MKC1200, MKF1120, MKW1120, MKG1120, MKP1120",
                    "SCABand": 3,
                    "UnitCode": "MKB1200",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Principles of marketing"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Liability for defective products; liability for misleading advice or information; contract law; agency law; partnership law; introduction to company law; company officers' duties.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students enrolled in course code 0816 must be granted permission to undertake this unit.",
                    "Prohibitions": "BTC1110, BTG1200, BTW1200, BTF1010, BTP1010",
                    "SCABand": 3,
                    "UnitCode": "BTB1010",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Commercial Law"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Introduction to spreadsheeting. Descriptive statistics. Elementary probability. Discrete and continuous probability distributions. Statistical inference. Simple linear regression and correlation. Forecasting and time series. Index numbers.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "BUS1100, PMM2020, ETC1000, ETG1102, ETW1000, ETX1100, SCI1020, STA1010, ETW1102",
                    "SCABand": 3,
                    "UnitCode": "ETB1100",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Business statistics"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit is designed to develop students' awareness of current theoretical perspectives on and of empirical evaluations of organisational initiatives designed to foster wellbeing at both the individual and organisational level. The unit will provide a macro-level framework for examining an organisation's social, ethical and environmental responsibility, followed by an examination of organisational level approaches to wellness including work/life initiatives and OH&S initiatives. At the micro-level the unit will address strategies the individual employees may use to manage their own state of wellness.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed MGP1010 or MGF1010 or MGW1010 or MGB1010 or MGG1010 before undertaking this unit.",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MGW3210",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Organisational wellness"
                }
            ],
            "year": 2017
        },
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Students gain an understanding of factors affecting the behaviour of people in work settings. The unit focuses on individual, group, and total organisational human factors influencing the effectiveness of organisations including: the nature of organisations in the global context; individual behaviour including perception, attitudes, values and personality, motivation and performance; group behaviour in organisations including the properties and management of groups, leaders and leadership, organisational power, influence, communication, conflict and decision making; organisational structure; organisational culture; change; the formal and informal organisation.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MGB1010 or MGC1010 or MGF1010 or MGG1010 or MGP1010 or MGW1010",
                    "Prohibitions": "MGC2230, MGF2111, MGG2230, MGW2230",
                    "SCABand": 3,
                    "UnitCode": "MGB2230",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Organisational behaviour"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Topics include the Corporations Act scheme; the role and functions of the Australian Securities and Investments Commission; the concept of limited liability; the effect of registration; the corporate constitution; the company's relationship with outsiders; share and loan capital; regulation of public fund raising; duties of directors, officers and promoters; rights of members and minority shareholder protection; forms of corporate insolvency administrations, particularly as they affect creditors, officers and shareholders.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed BTB1010, BTG1200, BTW1200 or BTB1200 before undertaking this unit.",
                    "Prohibitions": "BTC2210, BTC2213, BTW2220, BTW2213, BTF2220, BTG2220, LAW4171",
                    "SCABand": 3,
                    "UnitCode": "BTB2220",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Corporations law"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Introduction to management accounting. Topics include: basic terms and concepts, classification and behaviour of costs, recording product cost transactions for manufacturing firms, joint and by-product spoilage and waste, apportioning joint costs for multiple products, activity-based costing and information for management decisions.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "AFW1002, ACB1002, ACC1030, ACF1121, ACG1002, ACW1002, AFC1030, AFG1002, AFF1121.",
                    "Prohibitions": "ACC2131, ACF2391, ACG2020, ACW2020, AFC2131, AFF2391, AFG2020, AFW2020",
                    "SCABand": 3,
                    "UnitCode": "ACB2020",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Cost information for decision making"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit examines the current Australian reporting and regulatory framework applicable to reporting entities including an analysis of significant accounting standards, professional reporting requirements and legal and stock exchange requirements. Accounting for corporate groups and issues in financial reporting are also explored.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "AFW1000 or AFG1000 or ACB1000 and AFW1002 or AFG1002 or ACB1002 or ACC1030 or ACF1121 or ACG1002 or ACW1002 or AFC1030 or AFF1121.",
                    "Prohibitions": "ACC2120, ACF2491, ACG2491, ACG2491, AFC2120, AFF2491, AFG2491",
                    "SCABand": 3,
                    "UnitCode": "ACB2491",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Company reporting"
                }
            ],
            "year": 2017
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "The objective of this unit is two-fold. First, the unit provides students with a broad introduction to accounting information systems and the role technology plays in accounting. The focus will be on an introduction to: enterprise systems; database management; documentation methods; internal controls; and the core business processes found in organisations. Second, the unit focuses on corporate modelling theory; models as decision support tools; types and uses of models; benefits and limitations of models; effective spreadsheet design; auditing spreadsheet models and development of various models using an industry standard spreadsheet.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed one unit from the following: AFG1000, AFP1000, AFW1000 or AFW1001 (pre 2009) before undertaking this unit.",
                    "Prohibitions": "ACC2851, ACF2851, ACG2851, ACP2851, ACW2851, AFC2160, AFC2851, AFF2051, AFF2851, AFG2851, AFP2851, AFW2051, BUS1060, BUS3030",
                    "SCABand": 3,
                    "UnitCode": "ACB2851",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Accounting information systems and financial modelling"
                },
                {
                    "CreditPoints": 6,
                    "Description": "The aim of the unit is to introduce students to the theory and application of why and how value enhancing corporate financial decisions are made and implemented. With the emphasis on publicly listed companies, topics covered include; the corporate objective of management; investment evaluation models; valuation of equity and debt instruments; sources and types of funding; issues in risk and return; portfolio theory; asset pricing models; issues in capital structure and dividend policy; and the efficiency of capital markets. The unit is designed to ensure students gain the necessary skill set for making value-changing financial decisions to maximise firm value.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students to complete two units as follows: ECF1100 and ETF1100 or ECC1000 and ETC1000 or ECB1101 and ETB1100 or ECW1101 and ETW1000.",
                    "Prohibitions": "AFF2631, BFF2631, BFG2631, BFP2631, BFW2631, AFF2140, BFC2140, BFF2140, BFW2140.",
                    "SCABand": 3,
                    "UnitCode": "BFB2140",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Corporate finance 1"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Topics include the budget planning process including master budget preparation, budgeting standard costs and variance analysis, responsibility accounting, management by objectives and non-financial performance measurement, divisional performance, transfer pricing issues, program budgeting and other approaches, capital budgeting, strategic planning and control.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "ACB2020, AFW2020, AFC2131, AFF2391, AFG2020",
                    "Prohibitions": "ACC3131, ACF3431, ACG3021, ACW3021, AFG3021, AFW3021, AFC3131, AFF3431",
                    "SCABand": 3,
                    "UnitCode": "ACB3021",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Performance measurement and control"
                }
            ],
            "year": 2018
        },
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Analysis of the strategic role of HRM in organisations, human resource planning, job design, staffing, performance management, training and development, reward systems, legal issues in employment, HR information systems, and the contribution of HRM to competitive advantage.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MGB1010 or MGC1010 or MGF1010 or MGG1010 or MGP1010 or MGW1010",
                    "Prohibitions": "MGC2430, MGF2661, MGG2430, MGW2430",
                    "SCABand": 3,
                    "UnitCode": "MGB2430",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Human resource management"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit provides an introduction to Australian income tax law and practice. Topics include: Australian tax jurisdictional issues, assessable income from personal exertion, property and business, capital gains tax and fringe benefits tax, exempt income, deductions, both general and specific, GST, individual offsets.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must have passed BTB1200, BTG1200 or BTW1200 before undertaking this unit.",
                    "Prohibitions": "BTC3150, BTF3931, BTG3221, BTW3221",
                    "SCABand": 3,
                    "UnitCode": "BTB3221",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Taxation law and practice"
                }
            ],
            "year": 2018
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Business environments including markets, critical success factors, and strategies employed to gain a competitive advantage; the nature of strategic management; the analysis and interpretation of business environments; the nature of competition, relative position of firms, individual strategies and their relationship to critical success factors; strengths and weaknesses related to production, logistics, finance, research and development, marketing, administration etc.; the role of structure, controls, rewards, culture and leadership in implementation.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MGB1010 or MGC1010 or MGF1010 or MGG1010 or MGP1010 or MGW1010 and 96 credit points.",
                    "Prohibitions": "MGP3684, MGC3110, MGW3401, MGF3401, MGG3401",
                    "SCABand": 3,
                    "UnitCode": "MGB3684",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Business strategy"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit examines the auditor's legal liabilities, audit process and evidence, the concepts of materiality and risks, study and evaluation of internal control, EDP auditing, audit sampling techniques, the test of transactions cycles and the verification of account balances, auditors reports, and internal and operational auditing.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "ACB2491 or ACC2120 or ACF2491 or ACG2491 or ACW2491 or AFC2120 or AFF2491 or AFG2491 or AFW2491",
                    "Prohibitions": "ACW3041, AFG3041, ACG3041,  AFC3160, ACC3160, AFF3631, ACF3631",
                    "SCABand": 3,
                    "UnitCode": "ACB3041",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Auditing and assurance"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Financial accounting topics covered by this unit include: Australian accounting standards, institutional setting and the conceptual framework; accounting for leases; accounting for employee benefits; accounting for financial instruments; cash flow reporting; segment reporting; accounting for EPS; accounting for extractive industries; accounting for agriculture; financial reporting in the public sector; foreign currency translation; and social and environmental reporting.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "ACB2491",
                    "Prohibitions": "AFC3120, ACC3120, AFF3491, ACF3491, AFW3050, ACW3050, ACG3050 and AFG3050",
                    "SCABand": 3,
                    "UnitCode": "ACB3050",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Advanced financial accounting theory and issues"
                }
            ],
            "year": 2019
        }
    ]
}