{
    "courseCode": "B6009",
    "courseName": "Management",
    "courseType": "Expert master degree",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit provides an introduction to human behaviour in organisations. Behaviour is examined from the individual, group and organisational levels. The study of individual behaviour moves from consideration of personality and perception to values and attitudes and motivation. Group behaviour examines topics such as group structure and properties, group and team behaviour and leadership. These two areas of behaviour are then brought together to provide insight into the complex areas of organisational analysis (including structure and design and culture) as well as organisational processes. This multi-level organisational perspective develops student understanding and appreciation of current debates surrounding topics such as ethics and corporate social responsibility, power and influence and stress management.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "MGX5960",
                    "SCABand": 3,
                    "UnitCode": "MGF5960",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Off-campus)",
                                "First semester 2017 (Evening)",
                                "Second semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Managing people and organisations"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit focuses on enhancing students' understanding of problem solving and decision making processes in management practice, from a critical perspective on managerial thinking and action as an art of practical wisdom and sound judgment.Through interactive group work, role play, case studies and situational exercises, students will apply analytical reasoning and adaptive-creative methods of decision making to successfully manage organisational problems. Specific tools and techniques will be used to illustrate the complexity of managers' roles in defining problems; generating, evaluating and implementing solutions; balancing rationality and intuition; and making group decisions.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "MGX5680",
                    "SCABand": 3,
                    "UnitCode": "MGF5680",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Off-campus)",
                                "First semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Managerial problem solving and decision making"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit is an introduction to services and operations management concepts. The unit introduces operations management concepts in delivering value to customers, within and across organisations. Furthermore, the unit introduces and investigates service management in a variety of industry contexts, including discretionary and non-discretionary services. The services and operations concepts are synthesised through applied assessment.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "MGX5690",
                    "SCABand": 3,
                    "UnitCode": "MGF5690",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Day)",
                                "Second semester 2017 (Off-campus)",
                                "Second semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Services and operations management"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Examines change management from both theoretical and practical perspectives. Theory relating to employee responses to change and promoting readiness for change. Organisation Development -- characteristics of OD, process models, role of the practitioner, interventions; Organisational transformation -- nature and characteristics, models, strategic change leadership and capability.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "MGX9600, MGX5960, MGG5960, MGG9600 or MGG9370 or seek Chief Examiner approval before undertaking this unit.",
                    "Prohibitions": "MGX5972",
                    "SCABand": 3,
                    "UnitCode": "MGF5972",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Off-campus)",
                                "Second semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Managing organisational change"
                }
            ],
            "year": 2016
        },
        {}
    ]
}