{
    "courseCode": "B6011",
    "courseName": "Professional Accounting",
    "courseType": "Expert master degree",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit provides students with an introduction to accounting and an understanding of the preparation, presentation and interpretation of financial statements. In particular, emphasis is placed on accounting processes, practices and policies that enable the financial performance and financial position of an entity, as displayed by the balance sheet, income statement and statement of cash flows, to be measured, analysed and interpreted.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "AFF9500, AFG9071, ACG5971, AFX9500",
                    "SCABand": 3,
                    "UnitCode": "ACF5950",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "First semester 2017 (Evening)",
                                "Second semester 2017 (Day)",
                                "Second semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Introductory accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Microeconomics: scarcity; economic choice; economic systems; economic ideology; demand and supply analysis; consumer behaviour and elasticity; costs of production and profit maximisation; perfect competition and monopoly. Macroeconomics: aggregate demand and aggregate supply; Keynesian versus Neoclassical approaches; the money market and monetary policy; the government budget deficit and fiscal policy; the foreign exchange market and exchange rate policy; unemployment and inflation; the current and capital accounts.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "ECG9101, ECG5901, ECF9530",
                    "SCABand": 3,
                    "UnitCode": "ECF5953",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Evening)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Economics"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit examines business law in practice, including: negotiation techniques, applying contract law legal risk management techniques, applying the law of negligence, statutory consumer law protections and occupational health and safety choosing the most appropriate business form and complying with requirements, applying corporations law, the law of partnerships, agency and sole traders.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "BTG9270, BTX9020, MBA9002, BTX5140, BTX9030, BTF5904, BTM5903",
                    "SCABand": 3,
                    "UnitCode": "BTF5903",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "First semester 2017 (Evening)",
                                "Second semester 2017 (Day)",
                                "Second semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Law and business decisions"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Students will learn to use basic statistical techniques and apply them to problems in accounting, finance, management, marketing, and business in general. Students should also be able to effectively communicate the results of their analyses. This unit covers descriptive statistics for revealing the information contained in data; probability as a tool for dealing with uncertainty; probability distributions to model business behaviour; confidence interval estimation and hypothesis testing techniques for single populations; analysis of relationships between variables using simple linear regression; and simple tools for forecasting time series data. Applications to critical analysis of business and economic data will be emphasised. Excel software will be used.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "AFX9510, ETC1000, ETG1102, ETW1000, ETW1102, ETX1100 and ETC9000.",
                    "SCABand": 3,
                    "UnitCode": "ETF5900",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Business statistics"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "An overview of the Australian financial reporting and regulatory framework for reporting entities, including an analysis of the relevant significant accounting standards, benchmarking against the conceptual framework, professional reporting requirements and stock exchange requirements. Financial reporting for corporate groups (including the impact of control, joint control and significant influence) and selected issues in financial reporting are also explored and benchmarked against the conceptual framework.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "If students are enrolled in course 0503 there are no prerequisites. If students are enrolled in course 0748, 0790, 0826, 3843 or 4402 the prerequisite is AFX9500 or ACF5950.",
                    "Prohibitions": "AFF9601, AFG9073, AFX4601, AFX9530",
                    "SCABand": 3,
                    "UnitCode": "ACF5953",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "First semester 2017 (Evening)",
                                "Second semester 2017 (Day)",
                                "Second semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Financial accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit aims to develop students' understanding of the concepts and techniques of management accounting, and skills in the use of management accounting techniques to communicate decision-useful information to management. The unit content includes costing terminology, cost accumulation and recording systems, costing methods for both manufacturing and service-based organisations, how management accounting information informs key product decisions such as pricing and product mix, and the design of budget systems.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "AFX9500 or ACF5950",
                    "Prohibitions": "AFF9611, AFG9072, ACG5972, AFX5611, AFX9550",
                    "SCABand": 3,
                    "UnitCode": "ACF5955",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "First semester 2017 (Evening)",
                                "Second semester 2017 (Day)",
                                "Second semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Management accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Because most accounting systems are computerised, accountants must understand software and information systems to turn data into financial information and to develop and evaluate controls. This unit builds an understanding of the way accounting information systems work so that students may use, analyse and contribute to the design of accounting information systems and subsystems. Accordingly, the unit provides students with an understanding of critical information technologies that drive information systems; core business processes that allow an organisation to operate efficiently and effectively; common documentation tools used to diagram and assess business processes and databases; and internal control concepts that can be applied to mitigate risks.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Either ACF5950 or AFX9500",
                    "Prohibitions": "AFF2851, AFC2851, AFX9520, AFX9521, AFX9580 and ACF5958",
                    "SCABand": 3,
                    "UnitCode": "ACF5904",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)",
                                "Second semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Accounting information systems"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit covers corporate finance concepts and theories at an introductory level. Students will be expected to be able to master basic calculations involving share and bond valuations, NPV and IRR, company cost of capital, etc. and to use them in determining whether investment projects should proceed as well as the value of companies. They will also expected to be able to interpret the results and to discuss basic issues and theories appropriate to an introductory level unit.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "Students must be enrolled in 0503 or have passed ETF5900.",
                    "Prohibitions": "AFF9250, BFF5925, AFF9641, AFG9044, BFG5944, AFX9641, AFX9540",
                    "SCABand": 3,
                    "UnitCode": "BFF5954",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "First semester 2017 (Evening)",
                                "Second semester 2017 (Day)",
                                "Second semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Business finance"
                }
            ],
            "year": 2016
        },
        {},
        {
            "code": "S2-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "In today's business environment the accountant engages with the organisation's senior managers and contributes to strategy formulation and implementation. This unit focuses on the concepts and techniques of business strategy formulation and how management accounting information systems act as a corporate control system providing information for strategic decisions.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "If students are enrolled in course 0503 there are no prerequisites. If students are enrolled in course 0748, 0790, 0826, 3843 or 4402 prerequisite is ACF5955.",
                    "Prohibitions": "AFF5100, ACC5100",
                    "SCABand": 3,
                    "UnitCode": "ACF5100",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "First semester 2017 (Evening)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Strategic management accounting"
                },
                {
                    "CreditPoints": 6,
                    "Description": "The unit covers the concepts of income taxation and the taxation of capital gains in their underlying historical, social and constitutional contexts. It includes discussion and learning of the policy and constitutional matrices of taxation, the legal definition of income, taxation of income from personal services and business, taxation of fringe benefits, indirect taxation of goods and services, taxation of capital gains, taxation of companies and allowable deductions from gross income in personal and business contexts.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "BTG9270 and BTX9651",
                    "SCABand": 3,
                    "UnitCode": "BTF5965",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "First semester 2017 (Evening)",
                                "Second semester 2017 (Evening)"
                            ]
                        ]
                    ],
                    "UnitName": "Taxation law"
                }
            ],
            "year": 2017
        }
    ]
}