{
    "courseCode": "C3001",
    "courseName": "Computer Science Advanced",
    "courseType": "Bachelor degree (honours)",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces programming fundamentals and the Python language to students. The unit provides a foundational understanding of program design and implementation of algorithms to solve simple problems. Fundamental programming control structures, built in and complex datatypes and mechanisms for modularity will be presented in Python.Topics covered will include basic input and output, program control structures, basic data structures and modular program structure. Problem-solving strategies and techniques for algorithm development, iteration and recursion, algorithm efficiency and the limitations of algorithms will be introduced.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "VCE Mathematics Methods or Specialist Mathematics units 3 & 4 with a study score of 25 or MTH1010.Note: For 2016 Further Mathematics with a study score of 35 will be accepted.",
                    "Prohibitions": "FIT1029",
                    "SCABand": 2,
                    "UnitCode": "FIT1045",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)",
                                "October intake 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Algorithms and programming fundamentals in python"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces fundamental discrete mathematics topics including combinatorics, sets, relations and functions; methods of logic and proof, especially proof by induction; probability theory, Bayes' theorem; recursion; recurrence relations; trees and other graphs. It establishes the mathematical basis required for studies in Computer Science and Software Engineering.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "VCE Specialist Mathematics or Mathematical Methods units 3 and 4 with a study score of at least 25 or Further maths with a study score of at least 35.",
                    "Prohibitions": "MAT1077, MTH1112",
                    "SCABand": 2,
                    "UnitCode": "MAT1830",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)",
                                "October intake 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Discrete mathematics for computer science"
                },
                {
                    "CreditPoints": 6,
                    "Description": "The unit introduces students to fundamentals of computer systems, networks and security. It provides basic knowledge of computer organisation and architecture, operating systems, networking architecture, technology and operation. It introduces the concepts of security goals for protecting common modern computer systems and communication networks from adversaries and the deployment of suitable countermeasures to achieve these goals.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "",
                    "Prohibitions": "FIT1031 and FIT2078",
                    "SCABand": 2,
                    "UnitCode": "FIT1047",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "October intake 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "South Africa"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to computer systems, networks and security"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to core problem-solving, analytical skills, and methodologies useful for developing flexible, robust, and maintainable software. In doing this it covers a range of conceptual levels, from high-level algorithms and data-structures, down to the machine models and simple assembly language programming. Topics include data types; data structures; algorithms; algorithmic complexity; recursion; and translation to assembly language.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "((One of FIT1040, ECE2071, FIT1002) and FIT1029) or FIT1045Students beginning FIT1008 are assumed to be able to: Identify the main components of an algorithm (variables, operators, expressions, etc), and write the algorithm associated to the specification of a simple problem. Be able to translate a simple algorithm into a program containing variable declarations, selection, repetition, and lists and/or arrays.",
                    "Prohibitions": "CSE1303, CSC1030, FIT1015, FIT2085",
                    "SCABand": 2,
                    "UnitCode": "FIT1008",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to computer science"
                },
                {
                    "CreditPoints": 6,
                    "Description": "The unit covers linear algebra (vectors, equations of lines and planes, solutions of simultaneous equations, determinates, Gauss elimination, Gauss-Jordan method), calculus topics (differentiation, parametric differentiation, fundamental theorem of calculus, and numerical integration), an introduction to multivariable calculus (functions of several variables, partial derivatives, tangent planes and directional derivatives), and the construction of splines and Taylor series expansions are also covered.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "VCE Specialist Mathematics or Mathematical Methods units 3 and 4 with a study score of at least 25 or Further maths with a study score of at least 35.",
                    "Prohibitions": "ENG1090, MTH1020, MAT2003",
                    "SCABand": 2,
                    "UnitCode": "MAT1841",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Continuous mathematics for computer science"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to the research activities occurring in the Faculty of Information Technology. It provides an opportunity to conduct a hands-on project in an area of interest to the student and to experience what it is like to be a member of a research team.At the start of the semester the student will be assigned to one of the Faculty's research groups and assigned an academic supervisor and a project topic. Students may work individually or in groups, as determined by the supervisor of a particular topic. During the semester the student will be required to participate in research group events including seminars and presentations.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "Enrolment in course C3001",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "FIT1041",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Research project 1"
                }
            ],
            "year": 2016
        },
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to problem solving concepts and techniques fundamental to the science of programming. In doing this it covers problem specification, algorithmic design, analysis and implementation. Detailed topics include analysis of best, average and worst-case time and space complexity; introduction to numerical algorithms; recursion; advanced data structures such as heaps and B-trees; hashing; sorting algorithms; searching algorithms; graph algorithms; and numerical computing.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "One of FIT1008, FIT1015, FIT2085 or CSE1303 and 6 points of Level 1 mathematics.",
                    "Prohibitions": "CSE2304, FIT2009",
                    "SCABand": 2,
                    "UnitCode": "FIT2004",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Algorithms and data structures"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit prepares students to conduct research in Computer Science. It introduces students to the issues, concepts, methods and techniques associated with IT research in general, but focuses on those most commonly used for research in Computer Science. It introduces students to professional practice and research ethics, the principles of research design, research methods and techniques of data collection and analysis appropriate to Computer Science. It covers oral and written communication skills.Skills developed and knowledge acquired from this unit will prepare students to conduct and to communicate their own research, as well as to be knowledgeable consumers of others' research.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "At least 24 points of 1st year FIT units.",
                    "Prohibitions": "FIT2084, FIT4005",
                    "SCABand": 2,
                    "UnitCode": "FIT2083",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Research methods in computer science"
                }
            ],
            "year": 2017
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces formal languages, models of computation, and computational complexity. It looks at what computers can and cannot compute. Topics include finite state automata, regular expressions, grammars, pushdown automata, computable functions, Turing machines, polynomial-time reductions, complexity classes P and NP, and NP-completeness. Skills at writing formal proofs will be developed.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "One of FIT1045, FIT1048, FIT1051, ENG1003 or an equivalent introductory programming unit or (FIT1040 and FIT1029), and one of MAT1830, MTH1030, ENG1005 or equivalent.Students are expected to have basic competence in computer programming.",
                    "Prohibitions": "CSE2303",
                    "SCABand": 2,
                    "UnitCode": "FIT2014",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Theory of computation"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Ability to code in differently constructed programming languages is analogous to speaking in different natural languages with varying grammars. Similar to natural languages, programming languages from different paradigms (styles) vary in their expressiveness and efficiency. One programming language may require many screens-full of complex code to accomplish a task for which another requires but a few expressive lines of code. Therefore, understanding the design principles of programming languages enables computational problems to be implemented in drastically different and powerful ways; leading, in some cases, to solutions that are more elegant, correct, maintainable, efficient and/or extensible.This unit examines a selection of programming languages and paradigms and explores the evolution of language design from low-level paradigms that are closer to the execution model of the machine, to more high-level declarative paradigms that allow programmers to model a problem precisely rather than specify its solution. The unit covers paradigms such as functional and logic programming, comparing and contrasting them to programming styles that students are already familiar with, including object-oriented, imperative and procedural programming paradigms. Topics include specification and data-modeling techniques (covering types and polymorphism, mutability-versus-purity, state management, and side-effects) and different models of execution such as strict-versus-lazy evaluation.The unit provides practical experience with a variety of non-procedural, non-object-oriented programming languages and discusses the influence of programming language theory on the design of current main-stream computer languages, and how the theory translates to practice.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "FIT1008",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "FIT2102",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Programming paradigms"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit builds upon FIT1041 and FIT2083 or FIT2084 and allows students to conduct an independent research project. Students will be assigned to one of the Faculty of Information Technology's research groups, an academic supervisor and a research topic. Students may work on their project individually or in groups, as determined by their supervisor. During the semester, the student will be required to participate in research group events including seminars and presentations.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "FIT1041 and one of FIT2083 or FIT2084",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "FIT2082",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Research project 2"
                }
            ],
            "year": 2017
        },
        {
            "code": "S1-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 18,
                    "Description": "Students on placement participate full time in a defined, graduate level role during a 22-week placement period at established partners of the Faculty of IT industry based learning program including major global companies, leading Australian companies and worldwide consultancies. The students on placement apply the knowledge, skills and practices of professional attitudes and behaviour developed in their academic units. They develop communication, time management, self-reflection and customer service skills in business situations, experience and participate professionally in the corporate environment and obtain feedback from experienced supervisors on their performance.",
                    "EFTSL": 0.375,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "Available to students accepted into the Bachelor of Business Information Systems industry based learning stream at Clayton campus and students in all undergraduate degrees of the Faculty of IT who have been accepted into the Industry-based learning Placement program with at least 72 credit points of study accumulated towards a Faculty of Information Technology undergraduate degree.Prerequisite units for BBIS students (FIT1040 or FIT1002) and FIT1013 and FIT2003. Prerequisite units for BSE, BCS and BITS students (FIT1040 or FIT1002) and FIT2003.For 2016 degrees: This unit is available to students accepted into the Bachelor Information Technology degree at Clayton campus and students in all undergraduate degrees of the Faculty of Information Technology who have been accepted into the Industry-based learning placement program with at least 72 credit points of study accumulated towards a Faculty of Information Technology undergraduate degree.Prerequisite units for BSE, BCS and BInfoTech students commencing in 2016: One of FIT1045, FIT1048, FIT1051 or ENG1003Prerequisite units for BCS and BInfoTech students: FIT1049 or equivalentFor BInfoTech students completing the Business Information Systems major: FIT1013",
                    "Prohibitions": "BUS3000",
                    "SCABand": 2,
                    "UnitCode": "FIT3045",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Industry-based learning"
                }
            ],
            "year": 2018
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This advanced unit builds on the concepts learnt in introductory algorithms and data structures study. It covers the latest algorithmic paradigms and problem-solving techniques required to address real-world programming challenges. It explores, in depth, the design and analysis of space-efficient/compact data structures and effective problem solving strategies to be used with them. Topics include advanced sorting and searching algorithms, succinct/compact trees, string and graph data structures, advanced hashing and table lookup methods",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "FIT2004 and FIT2102",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "FIT3155",
                    "UnitLocationTP": "Not Offered in 2017",
                    "UnitName": "Advanced data structures and algorithms"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Modern computer systems contain parallelism in both hardware and software. This unit covers parallelism in both general purpose and application specific computer architectures and the programming paradigms that allow parallelism to be exploited in software. The unit examines shared memory and message passing paradigms in hardware and software; concurrency, multithreading and synchronicity; parallel, clustered and distributed supercomputing models, languages and software tools and development environments. Students will program in these paradigms.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "FIT2004C or C++ programming language",
                    "Prohibitions": "FIT4001, CSE4333",
                    "SCABand": 2,
                    "UnitCode": "FIT3143",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Parallel computing"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit will provide an introduction to the concepts of database design and usage and the related issues of data management. Students will develop skills in planning, designing, and implementing a data model using an enterprise-scale relational database system (Oracle). Methods and techniques will also be presented to populate, retrieve, update and implement integrity features on data in the implemented database system.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "FIT2099",
                    "Prohibitions": "FIT1004, FIT2094",
                    "SCABand": 2,
                    "UnitCode": "FIT3171",
                    "UnitLocationTP": "Not Offered in 2017",
                    "UnitName": "Databases"
                }
            ],
            "year": 2018
        },
        {},
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit is a research unit and a core unit for all Faculty of Information Technology Honours degrees. Due to the nature of IT, a wide range of Honours project types can be offered to students. Some project components are of a practical nature and may involve some software development and/or experimentation, while other components are of a more theoretical nature.This unit forms part of the sequence of units comprising the Honours thesis in the Faculty of Information Technology.Two exit points exist for the Honours thesis, FIT4444 (24 pts) and FIT4448 (18 pts). The 24 credit point exit point is applicable to:Bachelor of Business Information Systems (Honours), Bachelor of Computer Science (Honours), Honours degree of Bachelor of Computer and Information Sciences, Bachelor of Information Technology and Systems (Honours) and Bachelor of Informatics and Computation Advanced (Honours).The 18 credit point exit point is applicable to:Honours stream in the Bachelor of Software Engineering.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "Admission to an FIT Honours program.",
                    "Prohibitions": "CPE4000, CSE4000, IMS4000, FIT4126, FIT4186, FIT4246, FIT4606",
                    "SCABand": 2,
                    "UnitCode": "FIT4441",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "South Africa"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Honours thesis part 1"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit is a research unit and a core requirement for all FIT Honours degrees. Due to the nature of IT, a wide range of Honours project types can be offered to students. Some project components are of a practical nature and may involve some software development and/or experimentation, while other components are of a more theoretical nature.This unit forms part of the sequence of units comprising the Honours thesis in the Faculty of Information Technology.Two exit points exist for the Honours thesis, FIT4444 (24 pts) and FIT4448 (18 pts). The 24 credit point exit point is applicable to:Bachelor of Business Information Systems (Honours), Bachelor of Computer Science (Honours), Honours degree of Bachelor of Computer and Information Sciences, Bachelor of Information Technology and Systems (Honours) and Bachelor of Informatics and Computation Advanced (Honours).The 18 credit point exit point is applicable to:Honours stream in the Bachelor of Software Engineering.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "Admission to an FIT Honours program or stream.",
                    "Prohibitions": "CPE4000, CSE4000, IMS4000, FIT4126, FIT4186, FIT4246, FIT4606",
                    "SCABand": 2,
                    "UnitCode": "FIT4442",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "South Africa"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Honours thesis part 2"
                }
            ],
            "year": 2019
        },
        {
            "code": "S2-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit is a research unit and a core requirement for all FIT Honours degrees. Due to the nature of IT, a wide range of Honours project types can be offered to students. Some project components are of a practical nature and may involve some software development and/or experimentation, while other components are of a more theoretical nature.This unit forms part of the sequence of units comprising the Honours thesis in the Faculty of Information Technology.Two exit points exist for the Honours thesis, FIT4444 (24pts) and FIT4448 (18pts). The 24 credit point exit point is applicable to:Bachelor of Business Information Systems (Honours), Bachelor of Computer Science (Honours), Honours degree of Bachelor of Computer and Information Sciences, Bachelor of Information Technology and Systems (Honours) and Bachelor of Informatics and Computation Advanced (Honours).The 18 credit point exit point is applicable to:Honours stream in the Bachelor of Software Engineering.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "Admission to an FIT Honours program or stream.",
                    "Prohibitions": "CPE4000, CSE4000, IMS4000, FIT4126, FIT4186, FIT4246, FIT4606",
                    "SCABand": 2,
                    "UnitCode": "FIT4443",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "South Africa"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Honours thesis part 3"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit is a research unit and a core requirement for all FIT Honours degrees. Due to the nature of IT, a wide range of Honours project types can be offered to students. Some project components are of a practical nature and may involve some software development and/or experimentation, while other components are of a more theoretical nature.This unit forms part of the sequence of units comprising the Honours thesis in the Faculty of Information Technology.Two exit points exist for the Honours thesis, FIT4444 (24 pts) and FIT4448 (18 pts). The 24 credit point exit point is applicable to:Bachelor of Business Information Systems (Honours), Bachelor of Computer Science (Honours), Honours degree of Bachelor of Computer and Information Sciences, Bachelor of Information Technology and Systems (Honours) and Bachelor of Informatics and Computation Advanced (Honours).The 18 credit point exit point is applicable to:Honours stream in the Bachelor of Software Engineering.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Information Technology",
                    "Prerequisites": "Admission to an FIT Honours program.",
                    "Prohibitions": "CPE4000, CSE4000, IMS4000, FIT4126, FIT4186, FIT4246, FIT4606",
                    "SCABand": 2,
                    "UnitCode": "FIT4444",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "South Africa"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Honours thesis final"
                }
            ],
            "year": 2020
        }
    ]
}