{
    "courseCode": "D3001",
    "courseName": "Education",
    "courseType": "Bachelor degree (honours)",
    "teachingPeriods": [
        {},
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces contemporary learning theories that enable students to reflect on their own learning experiences in order to understand how others learn. From the perspective of broader educational settings (school, community, early childhood settings, home), the important questions of what learning is, how and why learning occurs, what quality learning might be and what influences learning, are discussed and reflected upon. Through examination of different theoretical perspectives and contexts, this unit focuses on building an understanding of what can influence learning and offers skill building in academic learning. Ideas closely associated with learning, including motivation, engagement and ability are also considered. The unit encourages students to begin constructing deep knowledge about the relationship between learning and educational inquiry.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "Enrolment in a Faculty of Education course",
                    "Prohibitions": "EDF1301",
                    "SCABand": 1,
                    "UnitCode": "EDF1303",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Understanding learning and learners"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit develops students' knowledge of the discipline of mathematics, content, concepts, skills and attitudes relevant to the effective teaching and learning of mathematics from Foundation to Year 8. Students build their capacity to apply teaching strategies to identify and address common misconceptions children have with numbers (including fraction and decimal numbers), plan and sequence lessons to maximise learning for children of varying abilities, and explore how learning can be facilitated through the effective use of digital technologies. Students also investigate and critique a range of teaching resources and reflect on their own engagement with mathematical tasks.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "EDF1204EDF1307",
                    "SCABand": 1,
                    "UnitCode": "EDF1206",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Mathematics education 1"
                },
                {
                    "CreditPoints": 0,
                    "Description": "This unit provides the means for managing fieldwork experience placements within the Bachelor of Education (Honours) course. This is the first of two fieldwork experience units students undertake in their first year.",
                    "EFTSL": 0,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF1101",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Fieldwork experience 1A"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This introductory unit lays the foundation for studies of Inclusive Education and the subsequent units in this discipline stream. The unit develops pre-service teachers' capacity to demonstrate knowledge and understanding of strategies for differentiating teaching to meet the specific learning needs of students across the full range of abilities, to maximise their learning and participation in schooling. They explore  key issues related to the education of diverse learners including those who may be disadvantaged because of social and/or personal circumstances. These students may experience exclusion and/or lack of opportunities for success in schooling because of  disabilities, ethnicity, gender, socio economic disadvantage, chronic health conditions and/or a range of other circumstances. In the unit students visit and build understanding of  various learning settings in which diverse learners are educated. Students explore  policies, legislation and research on  inclusive education practice in Victoria, Australia and worldwide, to inform their ability to show evidence of understanding the complexities of inclusive education.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF1551",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Foundation to inclusive education"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit builds on the focus in EDF1303 (Understanding learning and learners) to introduce contemporary approaches to teaching and their impact on learning. It enables students to demonstrate an understanding of curriculum and its role in teaching and learning in educational settings. Students are facilitated to demonstrate knowledge and skills in a range of teaching strategies including effective teaching models and assessment strategies that promote learning. Students develop knowledge and skills to engage in meaningful and respectful relationships with learners, their families and communities, in order to support learning.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "EDF1303",
                    "Prohibitions": "EDF1302",
                    "SCABand": 1,
                    "UnitCode": "EDF1304",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Understanding teaching for learning"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to the complexities involved in teaching English and literacy, and in developing theoretical perspectives on learning and teaching in the field. Students develop their own discipline knowledge of English. They are encouraged to research changing practices in the teaching of English, critically reflect on their own beliefs and teaching practices, and develop a robust theoretical perspective on the learning and teaching of literacy for a diverse range of learners. They focus on the range of ways children encounter and use symbol systems while exploring their diverse everyday worlds and building their literacy skills. Students develop understanding of relevant local and national English curriculum for schools, and the interrelated strands of language, literature and literacy.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF1205",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "English education 1"
                },
                {
                    "CreditPoints": 0,
                    "Description": "This unit provides the means for managing fieldwork experience placements within the Bachelor of Education (Honours) course. This is the second of two fieldwork experience units students undertake in their first year.",
                    "EFTSL": 0,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF1102",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Fieldwork experience 1B"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This introductory unit develops pre-service teachers' knowledge and understanding of assessment of the learning environment and diverse students' learning needs across the school years. An important aspect of teaching learners with diverse needs is to understand the learner well. Students learn the practical assessment processes of gathering and interpreting information for use by learners and their teachers, to decide where the learners are in their learning progression, what impacts on progress, and what strategies can maximise their learning. The focus of this unit is on assessment for learning as well as assessment of learning. Assessment for learning involves self-reflection and self-assessment, feedback and strategies that allow teachers to make better learning and teaching decisions. The unit develops pre-service teachers' own understanding of how their learning is taking place and how it can be developed. In addition, the unit develops understanding of assessment strategies, including informal and formal, diagnostic, formative and summative approaches to assess student learning, moderation processes and the use of information and communication technologies in learning and assessment",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF1552",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Using assessment to respond to diversity across the school years"
                }
            ],
            "year": 2017
        },
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit explores significant aspects of child and adolescent development, behaviours and relationships within the context of teacher education. It builds students' understanding of the psychological, motivational, social, cognitive, biological and socio-cultural perspectives of child and adolescent development and the possible implications for learning. Students inquire into strategies for learning and teaching with children and adolescents based on contemporary knowledge of development and fostering positive behaviour interactions and relationships for diverse learners. They develop understanding of how to develop a broad range of strategies for involving parents/carers and other community service and health providers in the educative process.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF2210",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Fostering positive child and adolescent behaviour and development"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit explores teaching science within five broad frames: science as a way of thinking and acting, learning about learning science, teaching as the transformation of knowing science, the engagement of learners and communicating science. The unit prepares students to develop a constructivist approach to teaching science, incorporating strategies such as connecting to children's prior knowledge, questioning and inquiry learning, hands-on approaches, scientific investigations and learner-owned/learner-centred investigations. The relationship among science, technology and society is explored, and the nature of science as a discipline is considered. Students build understanding of and demonstrate capacities to plan for science learning and teaching related to the Victorian and Australian curriculum from Foundation to Year 8.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF2214",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Science education"
                },
                {
                    "CreditPoints": 0,
                    "Description": "This unit monitors primary and secondary professional experience in the Bachelor of Education (Honours). Students complete the required number of days and the activities specified in the unit guide. Students' learning is supported by relevant academic staff in the Faculty of Education, and by teacher mentors in the education setting in which they are placed.",
                    "EFTSL": 0,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF2101",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Professional experience 2A"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit focuses on how to create positive classroom and school environments that engage all learners, including those with diverse needs. Students learn how learner behaviour, teacher behaviour, the curriculum and teaching strategies interact and can influence each other. Students explore the value of using evidence-based practices in creating engaging classroom environments for all learners. A key focus is learning some of the fundamental research based strategies that can be used in creating engaging classrooms for all learners, including those with diverse needs. The need to collaborate with colleagues and parents in creating engaging classrooms for all is also discussed.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF2551",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Understanding behaviour in classrooms and schools"
                }
            ],
            "year": 2017
        },
        {
            "code": "S2-01",
            "numberOfUnits": 5,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit explores local and global Indigenous perspectives on teaching and learning. It develops students' knowledge and understanding of Indigenous cultures with a particular focus on Aboriginal and Torres Strait Islander peoples. The unit considers Indigenous and other forms of education alongside the provision of mainstream schooling by nation states. Students develop their understanding of the impact of culture, cultural identity and linguistic background on the education of students from Aboriginal and Torres Strait Islander backgrounds. They explore and utilise education programs which have successfully engaged with learners from Indigenous and traditionally oriented societies and achieved improvements in their education outcomes. Students also develop broad knowledge, understanding and respect for Aboriginal and Torres Strait Islander peoples and their histories, cultures and languages, to meet expectations in the Australian Curriculum and the Australian Professional Standards for Teachers. They develop skills and insights into how to engage learners from Indigenous and traditional communities and create successful partnerships that improve academic outcomes and foster reconciliation.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF2031",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Term 2 2017 (On-campus block of classes)"
                            ]
                        ]
                    ],
                    "UnitName": "Indigenous perspectives on teaching and learning"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit further develops students' understanding of the complexities involved in the teaching of English and literacy and in developing theoretical perspectives on the learning and teaching of literacy and expert teaching practice in this field. The focus is on middle and upper primary. Students are encouraged to research changing literacy practices, critically reflect on their own beliefs and teaching practices, and develop a robust theoretical perspective on the learning and teaching of literacy to a diverse range of learners. Students critically examine current literacy practices, including assessment, curriculum and reporting of literacy learning, in order to develop effective methods of literacy pedagogy and planning in their own teaching. Students' pedagogical practices take into account the changing social futures and needs of primary school students.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF2213",
                    "UnitLocationTP": [
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "English education 2"
                },
                {
                    "CreditPoints": 0,
                    "Description": "This unit monitors primary and secondary professional experience in the Bachelor of Education (Honours). Students complete the required number of days and the activities specified in the unit guide. Students' learning is supported by relevant academic staff in the Faculty of Education, and by teacher mentors in the education setting in which they are placed.",
                    "EFTSL": 0,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "EDF2101",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF2102",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Professional experience 2B"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit develops students' understanding  of evidence-based learning and teaching practices in various educational settings for learners with diverse needs including (but not limited to) disabilities, health circumstances, and culturally, linguistically or socioeconomically diverse backgrounds.Students are equipped with sound knowledge and first-hand experience of working with learners with diverse needs using  varied learning and teaching strategies,that can be applied in a variety of educational settings, so they can identify strategies to support inclusive student participation and engagement in classroom activities. This includes  a particular focus on peer-assisted learning, cooperative learning, reciprocal teaching, providing feedback, differentiated instruction and ways in which positive relationships between teachers and students might be promoted. Students are also introduced to the principles of effective planning to equip them with knowledge and skills in curriculum development and lesson planning that are relevant for students with diverse needs, as well as a tool for reflecting on their practice.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF2552",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Learning and teaching for students with diverse needs in various education settings"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit develops students' knowledge and understanding of how to apply their content knowledge to classroom practice. They further develop their capacity to plan for differentiated learning for students across the full range of abilities, meet diverse learners' needs, and choose varied forms of behaviour management. Students explore a range of theoretical perspectives on the pedagogical practices of teachers. Students are encouraged to research multiple examples of teaching and learning practices, critically reflect on their own teaching practices and those of others, and develop a robust theoretical and practical perspective on the profession and their own classroom practice that is demonstrated through individual, group and peer written and oral presentations.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF2211",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Classroom practice"
                }
            ],
            "year": 2018
        },
        {
            "code": "S1-01",
            "numberOfUnits": 5,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit involves students in investigations of the educational policy and practice interface, through critical analyses of Victorian, national and international educational policy discourses around a range of issues and their impact on teachers' and school practices. Students develop understanding of what legislative requirements must be met, e.g. ensuring students' wellbeing and safety, anti-discrimination and equity laws. They explore how policies can impact on meeting diverse learners' needs and how they can be supported to ensure social justice, inclusion and equity for students from varied linguistic, cultural, religious and socio-economic backgrounds. Students examine the Melbourne Declaration on the Educational Goals for Young Australians and other federal and state policies that aim to develop curriculum and practice emphases in line with key priorities for education in Australia. Students also examine how a range of policies (including the cross-curriculum priority areas: developing understanding of and respect for Aboriginal and Torres Strait Islander peoples, histories, cultures and learner needs, developing education for sustainability, studies of Asia and the ethical use of information and communication technologies) are enacted at the school and classroom levels.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF3210",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Education policy and practice"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit further develops students' knowledge, skills and attitudes for becoming effective teachers of primary school mathematics. There is a focus on content in the measurement and geometry strand from Foundation to Year 8 of the Victorian Curriculum F-10 and the Australian Curriculum. Students engage with and critically reflect upon activities and approaches for developing understanding, fluency, problem solving and reasoning capacities associated with shape, using units of measurement, location and transformation, and geometric reasoning. Students engage with research on how children learn measurement and geometric principles, design a unit of work that addresses common misconceptions, and develop appropriate formative and summative assessments for this unit of work.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "EDF1206",
                    "Prohibitions": "EDF3301EDF4104",
                    "SCABand": 1,
                    "UnitCode": "EDF3212",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Mathematics education 2"
                },
                {
                    "CreditPoints": 0,
                    "Description": "This unit monitors primary and secondary professional experience in the Bachelor of Education (Honours). Students complete the required number of days and the activities specified in the unit guide. Students' learning is supported by relevant academic staff in the Faculty of Education, and by teacher mentors in the education setting in which they are placed.",
                    "EFTSL": 0,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "EDF2102",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF3101",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Professional experience 3A"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit prepares students to teach successfully in inclusive classrooms by learning about various ways the curriculum can be adapted to meet the learning and teaching needs of learners with diverse needs. Students learn about various teaching practices that could reduce the ability of learners with diverse needs to access the taught curriculum. They also learn about the key principles of adapting curriculum generally, but also at key transition periods, including when students move into primary school, from primary to secondary settings and from secondary settings to work. They gain skills in adapting text books, units of work and various learning tasks so that all learners can fully participate and benefit from school curriculum.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF3551",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Curriculum in inclusive education"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit requires students to critically engage with theories and practices associated with pedagogies used in secondary schooling in Years 7 to 12 and how these may differ from the primary setting. Students are supported in the development of their understandings of the pedagogical content knowledge and curriculum requirements associated with their chosen disciplinary field(s), and how these vary across year levels within their area(s) in a secondary school setting. In addition, the unit enables students to develop an understanding of how authentic learning experiences, in conjunction with the use of problem-solving strategies, can be employed to enhance student learning in Years 7 to 12. Students are required to draw upon both their classroom experiences and the research literature as they actively participate in their critical construction of relevant pedagogical content knowledge at these levels of secondary school.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF3269",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Secondary pedagogy A"
                }
            ],
            "year": 2018
        },
        {
            "code": "S2-01",
            "numberOfUnits": 6,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit focuses on how young children develop understandings in science, technology and environmental education in a variety of cultural contexts. Students research everyday environments at home and in the community to determine science and technology affordances and apply well-developed judgements for turning everyday concepts into scientific concepts. The teaching of these areas is examined from a range of theoretical perspectives and in relation to relevant regional/national curricula. Attention is paid to learning across the institutional contexts of home, early childhood setting and classrooms and students are expected to research and conceptualise both pedagogies and programs in ways that promote and meaningfully engage young children's learning of science, technology and environment.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF3035",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Term 4 2017 (On-campus block of classes)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Term 4 2017 (', 'Off-campus block of classes', ')"
                            ]
                        ]
                    ],
                    "UnitName": "Investigating our world: Science, technology and the environment"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This is the third unit in a sequence of three units that builds students' knowledge, skills and attitudes for becoming effective teachers of primary school mathematics. There is a focus on content in the statistics and probability strand of the Australian Curriculum. Students consolidate and synthesise their learning to critically reflect on activities and approaches for developing understanding, fluency, problem-solving and reasoning capacities associated with chance, data representation and data presentation. Students engage with research on how students learn and develop strategies for addressing more complex learning needs, including differentiating learning tasks, setting challenging tasks for more able children, and designing authentic learning projects that promote integrated learning. Students also develop their own numeracy skills essential for being a teacher and locate sources of professional learning for teachers of mathematics.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "EDF1206EDF3212",
                    "Prohibitions": "EDF4116",
                    "SCABand": 1,
                    "UnitCode": "EDF4267",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Mathematics education 3"
                },
                {
                    "CreditPoints": 0,
                    "Description": "This unit monitors primary and secondary professional experience in the Bachelor of Education (Honours) course. Students complete the required number of days and the activities specified in the unit guide. Students' learning is supported by relevant academic staff in the Faculty of Education, and by teacher mentors in the education setting in which they are placed.",
                    "EFTSL": 0,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "EDF3101",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF3102",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Professional experience 3B"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit develops students' knowledge and first-hand experience of working with learners who may require a higher degree of support for learning to ensure equitable participation and engagement at school. These are typically learners whose personal circumstances are more than usually complex and who may experience barriers or exclusion due to one or more factors including (but not limited to) disabilities/impairments, health concerns, socioeconomic status or family background. Evidence-based strategies for curriculum design and the use of technology are explored along with ways they may be instrumental in supporting the needs of these learners and their peers. Students build their knowledge of support services in schools and the community that are relevant to learners. Students develop expertise and experience in the skills of consulting, negotiating and facilitating as related to the roles of integration teacher, teaching assistants, families and professionals from a range of sectors, such as health professionals, social workers and out-of-home carers, who may be involved with the education, wellbeing and future success of these learners.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF3552",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Teaching and learning of students needing increased support"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit examines how school students can learn to understand the world through the humanities and social sciences (geography, history, economics, and civics and citizenship education), using single-disciplinary, multi-disciplinary and integrated lenses. Students explore how the humanities and social sciences are represented in national and local curriculum and how the learning area is taught in various ways throughout primary and secondary years. They engage with theoretical, philosophical, pedagogical viewpoints and assessment strategies that address issues deriving from the relevant curriculum frameworks, including the cross-curriculum priorities. Students also learn and develop the skills of lesson planning and implementation of curriculum in the learning area through single-disciplinary and/or integrated studies, using inquiry methodology.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF3216",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Humanities and social sciences education in the primary and secondary years"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to pedagogical and curriculum-related issues in arts education, from Foundation to Year 8, but with particular focus on teaching in, about and through the arts in primary schools. It provides students with an overview of different approaches to theories and practices of arts education. It prepares students for the tasks of selecting content and designing units of work in the arts. Students explore discipline-based arts (music, dance, drama, visual arts and media arts), as well as cross-curricula and integrative approaches to the arts.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF3213",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Creative arts education"
                }
            ],
            "year": 2019
        },
        {
            "code": "S1-01",
            "numberOfUnits": 5,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit builds students' capacity to demonstrate knowledge and understanding of research into how students learn, teaching and learning theory and practice and the implications in varied education contexts. Students explore principles, approaches and methods for conducting and applying educational research. They investigate issues such as what 'counts' as research, where research can occur, what is to be researched, how research can be undertaken, why research is important and what constitutes a research community in the context of their particular discipline and specialisation. They learn how to generate and use data ethically to inform their educational work and develop an evidence base for this work.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF4100",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Term 2 2017 (On-campus block of classes)",
                                "Term 4 2017 (On-campus block of classes)"
                            ]
                        ]
                    ],
                    "UnitName": "Researching teaching and learning"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit is the third in a sequence of three units to prepare students to teach English language, literacy and literature in primary schools. Students develop an understanding of their role as teachers of literacy across the curriculum with specific attention to Years 5 to 8. The unit explores a range of theoretical perspectives on the learning and teaching of English. Students also analyse current policy documents in order to understand how these mediate teachers' work.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "EDF1205EDF2213",
                    "Prohibitions": "EDF4112EDF4406",
                    "SCABand": 1,
                    "UnitCode": "EDF4266",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "English education 3"
                },
                {
                    "CreditPoints": 0,
                    "Description": "This unit monitors primary and secondary professional experience in the Bachelor of Education (Honours). Students complete the required number of days and the activities specified in the unit guide. Students' learning is supported by relevant academic staff in the Faculty of Education, and by teacher mentors in the education setting in which they are placed.",
                    "EFTSL": 0,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "EDF3102",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF4041",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Professional experience 4A"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit further develops students' understanding of the key concepts and practical applications of curriculum, curriculum theory, assessment and evaluation. Students build their capacity to apply their knowledge of assessment strategies including informal and formal, diagnostic, formative and summative approaches, and assessment moderation and its application to assessing and improving student learning in varied contexts. They learn how to provide feedback and report to students and parents using accurate and reliable records of student achievement.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF4260",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Curriculum, assessment and evaluation"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit explores the teaching and learning of health and physical education (HPE). The unit enables students to build knowledge and gain experience in the unique teaching and learning environment of HPE. It provides historical, philosophical and pedagogical foundations of HPE, enabling students to develop confidence and competence in teaching HPE to students in the primary years.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF4268",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Health and physical education"
                }
            ],
            "year": 2019
        },
        {
            "code": "S2-01",
            "numberOfUnits": 5,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit builds students' capacity to research teaching and learning in particular educational contexts. Students apply some of the principles and methods of educational research they have learned about by developing a short literature review related to the proposal developed in EDF4100. They then demonstrate their capacity to generate and use data ethically via a research project related to their particular discipline and specialisation. This is focused on examining practice in an education setting, school or classroom, using methods that may include focus groups, interviews, self-study, action research or participant observation. Finally, students demonstrate a clear and coherent exposition of the knowledge they have gained through the presentation of their findings to their peers and in a written report.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF4101",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "City (Melbourne)"
                            ],
                            [
                                "Term 1 2017 (On-campus block of classes)",
                                "Term 3 2017 (On-campus block of classes)"
                            ]
                        ]
                    ],
                    "UnitName": "Research project in education"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit prepares students for their transition from initial teacher education to their professional practice as teachers. Drawing on a range of research literature and the knowledge, skills and professional experiences developed during all years of their course, students are inducted into the notion of what it means to be engaged in the teaching profession through consideration of the nature of teachers' work and of leadership in education. This includes the ethical, professional, industrial, legal, emotional, intellectual and personal dimensions of the work of teachers and educational leaders. Students gather evidence of and critically reflect on their emerging professional identity as practitioners, and on the Graduate Teaching Standards and graduate attributes they have developed that enable them to be skilled teachers and potential education leaders. They explore the ways in which they can engage with and initiate professional communities of educators in and beyond their immediate professional settings. Students develop understanding of the process of applying for positions and transitioning to the profession in ways that enhance and improve their employability. They continue to develop their literacy, numeracy and information and communication technology (ICT) skills and knowledge through synthesising a variety of theoretical and practical perspectives they have encountered throughout their course.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF4006",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Peninsula"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Transition and professional engagement"
                },
                {
                    "CreditPoints": 0,
                    "Description": "This unit monitors primary and secondary professional experience in the Bachelor of Education (Honours). Students complete the required number of days and the activities specified in the unit guide. Students' learning is supported by relevant academic staff in the Faculty of Education, and by teacher mentors in the education setting in which they are placed.",
                    "EFTSL": 0,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "EDF4041",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF4042",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Professional experience 4B"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit recognises that collaboration and ongoing consultation among teachers, administrative and support personnel, parents, students, allied health professionals and agency representatives are essential for teachers working with children with diverse needs in a variety of educational settings. The unit enables students to identify and develop the skills of collaboration and promote positive inter-professional practice in the workplace. Students are encouraged to identify key stakeholders when working collaboratively, as well as the issues that can occur when working as joint partners with others, including potential sources of conflict. Finally, students are encouraged to critically analyse the advantages and disadvantages of working inter-professionally and the need to evaluate collaborative practice.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF4551",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Collaborative principles, partnerships and procedures"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit requires students to critically engage with the pedagogical theories and practices relevant to upper secondary schooling. Using their chosen disciplinary field(s) as context, students are supported in developing an understanding of how a range of pedagogical approaches need to be considered in relation to individual student needs and the requirements of senior secondary curriculum and assessment frameworks. In particular, this unit offers students opportunities to further develop pedagogical content knowledge relevant to their chosen disciplinary field(s) and examine engaging and innovative approaches to teaching and learning within the constraints of externally moderated senior secondary curriculum. They are required to draw upon both their classroom experiences and the research literature as they reflect on the critical construction and utilisation of relevant pedagogical content knowledge in the senior years of secondary schooling.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Education",
                    "Prerequisites": "EDF3269",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "EDF4269",
                    "UnitLocationTP": [
                        [
                            [
                                "Berwick"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Secondary pedagogy B"
                }
            ],
            "year": 2020
        }
    ]
}