{
    "courseAOS": "Bachelor of Environmental Engineering (Honours)",
    "courseCode": "E3001",
    "courseName": "Engineering",
    "courseType": "Bachelor degree (honours)",
    "faculty": "Faculty of Engineering",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit develops a process for the analysis and design of static and dynamic structures and mechanisms using engineered materials. Through a multidisciplinary approach, the fundamentals of mechanical, civil and material engineering will be explained and the basic concepts of loads and motions are introduced.Team based projects will highlight the multidisciplinary nature of modern engineering. These concepts will be practised through hands-on projects carried out by teams. Communication and teamwork skills will be developed through teamwork tasks.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "None",
                    "Prohibitions": "ENG1020, ENG1040, ENG1050",
                    "SCABand": 2,
                    "UnitCode": "ENG1001",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)",
                                "October intake 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Engineering design: lighter, faster, stronger"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Vector algebra and geometry: equations of lines and planes. Linear algebra: matrix operations, up to 3x3 systems of linear equations, eigenvalues and eigenvectors. Calculus: improper integrals, integration by parts. Sequences and series: fundamentals of convergence, Taylor series, use in error analysis. Ordinary differential equations: first order, second order with constant coefficients, repeated roots, simple non-homogeneous cases. Laplace transforms: elementary functions, inversion by tables; shifting; derivatives, applications to ODEs. Multivariable calculus: partial derivatives, gradient and directional derivatives, maxima and minima.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "VCE Specialist Mathematics or ENG1090 (or equivalent)",
                    "Prohibitions": "ENG1091, MTH1030, MTH1035",
                    "SCABand": 2,
                    "UnitCode": "ENG1005",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)",
                                "October intake 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Engineering mathematics"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "ENG1090 (if required) or PHS1080 (if required) or 1 st year engineering elective",
                    "UnitName": ""
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "Elective If two foundation units are required then this elective is used to complete the second of ENG1090 and PHS1080 ,",
                    "UnitName": ""
                }
            ],
            "year": 0
        },
        {
            "code": "S2-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Fundamentals of electrical, chemical and materials engineering will be introduced and applied to provide technological solutions for real-world problems. Theory underpinning analogue and digital circuit design; energy and mass balance; materials processing and the role of functional materials will be presented. The contribution of each topic to a contemporary engineering application will be demonstrated.Team based projects will highlight the multidisciplinary nature of modern engineering. These concepts will be practiced through hands-on projects carried out by teams. Communication and teamwork skills will be developed through teamwork tasks.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "None",
                    "Prohibitions": "ENG1010, ENG1030",
                    "SCABand": 2,
                    "UnitCode": "ENG1002",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Engineering design: cleaner, safer, smarter"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to the use of Information Technology (IT) in modern engineering practice. Students will learn an object-oriented approach to both computer systems and software engineering for solving engineering problems.Students will work in small teams to develop a mobile application that meets a contemporary need in engineering. The fundamental stages in the software development lifecycle will be introduced, including requirements analysis, design, implementation and verification. Students will use IT tools to support the engineering process.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "ENG1003",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Engineering mobile apps"
                },
                {
                    "CreditPoints": 6,
                    "Description": "General rules for software development and design. Errors. Data types, variables, expressions, control statements M-files. Numerical techniques: Gauss elimination, solution of non-linear equations, optimisation, curve fitting, numerical calculus, ordinary differential equations.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "Mathematical methods (CAS) recommended.",
                    "Prohibitions": "ENG1602",
                    "SCABand": 2,
                    "UnitCode": "ENG1060",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)",
                                "October intake 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Computing for engineers"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "Faculty of All",
                    "SCABand": 0,
                    "UnitCode": "Free Elective",
                    "UnitName": "Choose from any faculty"
                }
            ],
            "year": 0
        },
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit is an introduction to ecology; the scientific study of the interactions between organisms and their environment. Ecology and biodiversity forms the foundation for understanding conservation and the management of genetics, species and ecosystem diversity. The approach taken is to address core ecological theory, but with an emphasis on contemporary management issues and applications. Topics include the scope and approaches of ecological enquiry; abiotic and biotic factors determining distributions; population growth and regulation; species interactions; patterns and maintenance of biodiversity; food web analysis; disturbance and succession; and production ecology and nutrient cycling. Particular emphasis is placed on integrating ecological processes across spatial and temporal scales. Practical work will be completed via a field excursion together with in-laboratory practical sessions.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Science",
                    "Prerequisites": "24 points of level one units, which includes 6 points from BIO units or one of ATS1301, ATS1309, ATS1310, BMS1011 or BMS1021.For Bachelor of Environmental Engineering and associated double degree students only: ENE1621 Environmental engineering and BIO2040 Conservation biology will be required as either prerequisite or corequisite units.",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "BIO2011",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Ecology and biodiversity"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Introduce fundamentals and applications of classical thermodynamics. Understand the concepts of heat, work, energy, and entropy, the First and Second Laws of Thermodynamics and their application. Introduction to the Carnot cycle and the concept of irreversibility. Understand the use of property diagrams in solving heat engine and heat pump cycles. Understand the operation and analysis of the Brayton, Otto, Diesel and Rankine cycles. Introduction to the analysis of refrigeration and heat pump cycles. Perform experiments to illustrate the concepts of Thermodynamics. Simple combustion processes. Renewable energy and its use in heating and electricity generation and environmental benefits.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "CHE2164",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Thermodynamics I"
                },
                {
                    "CreditPoints": 6,
                    "Description": "The unit focuses on fundamentals of hydraulics. Hydrostatics is first introduced with application to dam and gates. The basic equations of continuity, momentum and energy conservation are derived and applied to the design of pressurised pipelines. Flow in open channels is introduced with application to waterways, aqueducts and pipes flowing partly full; applications include design of spillways and culverts.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "CIV2263",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Water systems"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "Faculty of All",
                    "SCABand": 0,
                    "UnitCode": "Free Elective",
                    "UnitName": "Choose from any faculty"
                }
            ],
            "year": 1
        },
        {
            "code": "S2-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit will introduce students to the fundamentals of material and energy balances through a systematic treatment of:  single and multiple unit operations, reactive and non-reactive processes, recycle and by-pass, extent of reactions, equations of state, vapour-liquid phase equilibrium, solid-liquid phase equilibrium, internal energy and enthalpy changes for process fluids undergoing specified changes in temperature, pressure, phase, reactions and chemical compositions and computer aided simulation of process flow diagrams. A process simulation software will be used to aid in the solution of more complex systems.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "",
                    "Prohibitions": "CHE2113, CHE2140",
                    "SCABand": 2,
                    "UnitCode": "CHE2162",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Material and energy balances"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Advanced matrix algebra: mxn systems, linear independence, sparse matrices, simple tensors. Further ordinary differential equations: systems of ODEs, variation of parameters; boundary-value problems. Fourier series: Euler formulae, convergence, half-range series, solution of ODEs, spectra. Further multivariable calculus: change of variables and chain rule, polar coordinates, line integrals; vector fields; del, divergence, curl and Laplacian; surface and volume integrals; Gauss and Stokes theorems. Partial differential equations: simple PDEs, Laplace, heat and wave equations, superposition, separation of variables, polar coordinates. Advanced numerical methods: solution of linear systems, numerical solution of ODEs and simple PDEs, accuracy, efficiency and stability; discrete Fourier transforms, introduction to PS and FE methods.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "ENG1005 or ENG1091 or equivalent",
                    "Prohibitions": "ENG2091, MTH2010, MTH2015",
                    "SCABand": 2,
                    "UnitCode": "ENG2005",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Advanced engineering mathematics"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit will give the students an appreciation of materials, their place in the environment and ways of dealing with their presence in the waste stream. The students will gain a basic understanding of the structure and properties of the main classes of materials: metals, polymers and ceramics. Students will learn about the ways in which these different materials can be disposed of, ranging from incineration, recycling and degradation, and the technologies involved in these processes. The advantages of these methods, as opposed simply to landfill, will be discussed. Methods of sorting of different materials from the waste stream into their various components will also be covered.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "ENE2503",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Materials properties and recycling"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "Faculty of All",
                    "SCABand": 0,
                    "UnitCode": "Free Elective",
                    "UnitName": "Choose from any faculty"
                }
            ],
            "year": 1
        },
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Overview of concepts relating to groundwater resources and seepage, with emphasis on seepage containment in reservoirs, ponds, soil pollution and its avoidance, focusing on soil behaviour and its effect on seepage, groundwater percolation and migration of contaminant in the nearfield of waste containment facilities.  Focus will also be on the function, design and construction of engineered soil barriers to prevent leakage from water reservoirs, ponds or to isolate different types of waste.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "CIV3248",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Groundwater and environmental geomechanics"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "CIV3xxx Engineering hydrology",
                    "UnitName": ""
                },
                {
                    "CreditPoints": 6,
                    "Description": "Energy resources, chain, and energy conversion processes; non-renewable (fossil, nuclear) and renewable (photovoltaic, wind, hydro-, biomass) sources of energy; environmental impact of electricity generation; energy storage technologies; direct and indirect energy conversion; overview of the world and Australian energy production and consumption; the future energy scenarios.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "Must have passed 72 credit points",
                    "Prohibitions": "ECE3051, ECE3502, ECE4053, ECE4503",
                    "SCABand": 2,
                    "UnitCode": "ENE3048",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Energy and the environment"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "Faculty of All",
                    "SCABand": 0,
                    "UnitCode": "Free Elective",
                    "UnitName": "Choose from any faculty"
                }
            ],
            "year": 2
        },
        {
            "code": "S2-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Through lectures, practice classes, individual assignments and tests, students should develop knowledge of air pollution issues, assessment and control of pollutants from emission sources. The unit focusses on air pollution sources, emissions behaviour, pollutant pathways, receptor impacts and the associated national legislation and international treaties. The unit includes atmospheric stability conditions, pollutant transport models, air pollution control strategies and factors important in control equipment or schemes. The unit also encompasses climate change, greenhouse gas emissions sources and carbon accounting as well as national and international climate change mitigation strategies and adaptation approaches.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "CHE2162",
                    "Prohibitions": "ENE3604",
                    "SCABand": 2,
                    "UnitCode": "ENE3606",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "The air environment"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "BTC3100",
                    "UnitName": "Cannot Fetch Data"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "Environmental engineering technical elective",
                    "UnitName": ""
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "Faculty of All",
                    "SCABand": 0,
                    "UnitCode": "Free Elective",
                    "UnitName": "Choose from any faculty"
                }
            ],
            "year": 2
        },
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit examines the process of economic development and its effects on prosperity, poverty and sustainability. The unit begins by studying the sources of prosperity via economic growth in the modern era, with particular reference to the Great Divergence in incomes that started during the 1800s. Second, the unit asks why some economic systems have prospered, whilst others have declined by turning its attention to disparate experiences of world-wide economic growth such as poverty and starvation. Finally we study the effects and prospects for future economic development in the context of environmental sustainability and climate change.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Business and Economics",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "ECC2800",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Prosperity, poverty and sustainability in a globalised world"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "CIV2XXX Project management for civil engineers",
                    "UnitName": ""
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "ENE4xxx Environmental impact assessment and management systems",
                    "UnitName": ""
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "Faculty of All",
                    "SCABand": 0,
                    "UnitCode": "Free Elective",
                    "UnitName": "Choose from any faculty"
                }
            ],
            "year": 3
        },
        {
            "code": "S2-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit aims to synthesize the various components of the Environmental Engineering degree, enabling development of a comprehensive approach to identifying, assessing and planning management approaches to the array of environmental risks associated with engineering. A critical aspect of this unit will be class discussions, where participation in broad ranging debate will be actively encouraged for all students. Communication skills are critical for environmental issues in engineering, as there are commonly differences of opinion with regards to environmental risks as well as their respective solutions. This unit seeks to unify environmental risk assessment in an engineering context.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Engineering",
                    "Prerequisites": "Must have passed 120 points",
                    "Prohibitions": "ENE4601",
                    "SCABand": 2,
                    "UnitCode": "ENE4607",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Environmental risk assessment"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "Environmental engineering elective stream",
                    "UnitName": ""
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "Environmental engineering elective stream",
                    "UnitName": ""
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "Faculty of All",
                    "SCABand": 0,
                    "UnitCode": "Free Elective",
                    "UnitName": "Choose from any faculty"
                }
            ],
            "year": 3
        }
    ]
}