{
    "courseCode": "F6002",
    "courseName": "Design",
    "courseType": "Master degree",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 4,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit is developed to introduce non-cognate students in Masters courses to Design Thinking, and to its application within a wide range of problems and situations. These skills and strategies include a range of conceptual and communication approaches, ways to investigate and reconsider the context in which we work and live, as well as potential for innovation.  Design Thinking brings together some approaches that are known in the sciences and humanities, such as analysis and synthesis, but applies them in ways that are particular to a design approach.  Design Thinking can enable a more flexible approach to problems, and a more nuanced engagement with the complex issues of our contemporary world. This unit will introduce students to the key skills and practices associated with Design Thinking, and offer opportunities to explore the application of these basic creativity techniques. The course is delivered partly on-line, with lectures and workshops offering key activities supporting students' learning.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Art, Design and Architecture",
                    "Prerequisites": "",
                    "Prohibitions": "ADA1111, ADA3111",
                    "SCABand": 1,
                    "UnitCode": "ADA4500",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (On-campus block of classes)",
                                "Second semester 2017 (On-campus block of classes)",
                                "Term 2 2017 (On-campus block of classes)",
                                "Term 4 2017 (On-campus block of classes)"
                            ]
                        ],
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (', 'Off-campus block of classes', ')",
                                "Second semester 2017 (', 'Off-campus block of classes', ')",
                                "Term 2 2017 (', 'Off-campus block of classes', ')",
                                "Term 4 2017 (', 'Off-campus block of classes', ')"
                            ]
                        ]
                    ],
                    "UnitName": "Design thinking approaches"
                },
                {
                    "CreditPoints": 6,
                    "Description": "The Design Fundamentals Studio is specifically created to enable non-cognate students within the Master of Design to understand and practice the concepts, theories and skills expected of design enquiry and intervention to solve problems. Students undertake a series of exercises concerned with the processes that underpin the composition and assembling of the elements of form, shape and narrative in response to visual, object, spatial and temporal investigation and problem solving. The acquired skills and knowledge will enable the student to approach advanced design challenges with confidence.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Art, Design and Architecture",
                    "Prerequisites": "Enrolment in Master of Design (Coursework)",
                    "Prohibitions": "MDC4001",
                    "SCABand": 1,
                    "UnitCode": "MDC4500",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (On-campus block of classes)",
                                "Second semester 2017 (On-campus block of classes)"
                            ]
                        ]
                    ],
                    "UnitName": "Design fundamentals studio"
                },
                {
                    "CreditPoints": 12,
                    "Description": "This unit introduces students to the relevant technical processes that will be drawn upon in subsequent and concurrent studio units within the Master of Design. It includes digital and physical fabrication for design outcomes relative to the nominated studio specialisations of Interaction Design, Multimedia Design and Collaborative Design. The unit focuses on the technical and practical capabilities required for the creation of design prototypes. Students will be introduced to the interdisciplinary nature of design technologies and equipped with fundamental design skills and methods through project work and a series of hands-on exercises. Students develop a repertoire of knowledge through the exploration of the concepts, methodology and vocabulary for production, publishing, presentation and prototyping techniques relative to their studio specialisation.",
                    "EFTSL": 0.25,
                    "Faculty": "Faculty of Art, Design and Architecture",
                    "Prerequisites": "Enrolment in Master of Design (Coursework)",
                    "Prohibitions": "VCM4101, VCM4601, VCM4602, MDC4215",
                    "SCABand": 1,
                    "UnitCode": "MDC4550",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (On-campus block of classes)",
                                "Second semester 2017 (On-campus block of classes)"
                            ]
                        ]
                    ],
                    "UnitName": "Design technologies and processes"
                },
                {
                    "CreditPoints": 0,
                    "Description": "An introduction to occupational health, safety and environmental training within the context of courses within the Faculty of Art and Design, together with an understanding of the historical perspectives and context of safety and environment concerns in the workplace. The difference between hazard and risk, and the process of risk assessment in workplaces.",
                    "EFTSL": 0,
                    "Faculty": "Faculty of Art, Design and Architecture",
                    "Prerequisites": "Admission to any Art Design and Architecture course",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "OHS1000",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Off-campus)",
                                "Second semester 2017 (Off-campus)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to art and design health and safety"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "The unit examines methodological approaches to design research, from the scientifically oriented to the phenomenological, the discursive and the poetic.  Attention is given to the way in which the terms of an investigation inevitably shape the material which is discovered.  The range of topics may include techniques in information gathering and efficient management of bibliographic resources, postmodern theory, difference studies, post-structural writing and deconstruction.  The unit ponders the relationship of studio research (i.e. designing innovative objects or spaces or interfaces) to conventional research.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Art, Design and Architecture",
                    "Prerequisites": "Six credit points in any level 3 theory (TAD) unit",
                    "Prohibitions": "TAD4521,TAD4522",
                    "SCABand": 1,
                    "UnitCode": "TAD4523",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Design research methods and seminar"
                },
                {
                    "CreditPoints": 12,
                    "Description": "This unit develops fundamental knowledge and principles in interaction design and focuses on creating innovative models of interaction between human beings and technology. Students will be introduced to the interdisciplinary nature of interaction design, and develop a repertoire of knowledge through the exploration of problem solving methodologies. A major design project encourages experimentation and skill development with tangible materials and interactive technology via data gathering, analysis, evaluation and design.",
                    "EFTSL": 0.25,
                    "Faculty": "Faculty of Art, Design and Architecture",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "MDC4201",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Fundamental interaction design studio 1"
                }
            ],
            "year": 2016
        },
        {},
        {
            "code": "S2-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 24,
                    "Description": "The research project studio unit in the Master of Interaction Design aims to consolidate learning from previous studio units and integrate the technical, cognitive and creative skills required to design for industry. By providing opportunities for students to participate in leading industrial projects, designing interactive artefacts, systems or services, students will be exposed to specifically situated problems and evaluate innovative solutions that weave together technology, place and product with specific intents in specific contexts.The unit encourages experimentation and skill development with tangible materials and interactive technology via data gathering, analysis, evaluation and design. Students will produce publication quality designs which examine the extension of physical artefacts and tangible interface as elements of connectivity that help users to mediate between the information world and everyday life.The project supports students in a broad range of interests, including the application of advanced technologies, electronics and programming, physical or virtual interface manipulation, and material and engineering fabrication.",
                    "EFTSL": 0.5,
                    "Faculty": "Faculty of Art, Design and Architecture",
                    "Prerequisites": "MDC5201 or MDC5215, and MDS5031, or with permission from the Course Coordinator",
                    "Prohibitions": "",
                    "SCABand": 1,
                    "UnitCode": "MDC5202",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Interaction design research project"
                }
            ],
            "year": 2017
        }
    ]
}