{
    "courseCode": "M2002",
    "courseName": "Health Sciences",
    "courseType": "Bachelor degree",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit is the first of two units designed to educate health science students about the anatomical structures and physiological functions of the systems of the human body that underpin the regulatory mechanisms for homeostatic control. Students will be introduced to the principles of cell biology, tissue types and their origins together with their importance in maintaining the homeostasis of the various body systems. The key anatomical features of the integumentary and musculoskeletal systems will be examined as well as their role in the control of homeostasis. The central and peripheral nervous system will be addressed in the context of its physiological characteristics and with special attention to the anatomical features of the spinal cord and brain. Students will be introduced to the various functions of the brain in the context of homeostasis and control, together with the special senses. Throughout the unit, clinical connections will be made with the systems addressed so that students will understand the relevance of the topics included in the unit to the health and human science disciplines.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "BMA1901",
                    "SCABand": 2,
                    "UnitCode": "BMA1011",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Foundations of anatomy and physiology for health practice 1"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to the skills necessary to locate, critique, interpret and summarise relevant evidence. This will provide a solid foundation for an evidence-based approach to optimising health and well-being at a population level.Students are guided through skills in searching for and locating evidence. They are introduced to different research methodologies and ways of analysing data to understand various research paradigms. This information is used to critique the available literature.Students will be introduced to both qualitative and quantitative methods of data collection and analysis; basic descriptive statistics; measurement concepts; and synthesis and reporting of data.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "HSC1061, PHH1061.",
                    "SCABand": 2,
                    "UnitCode": "HSC1100",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to research and evidence"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit provides an introduction to the principles and practices of contemporary public health. Case study examples are used to illustrate public health successes, including the key elements contributing to these successful approaches.Key concepts introduced include population health, social determinants of health, health inequalities, health and human rights, and the core roles and functions of public health systems, policies and programs.Inequalities within and across national boundaries are explored, as well as the contributing factors to these inequalities. Public health priorities are explored through consideration of population health trends and vulnerable populations.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "HSC1081, PHH1081.",
                    "SCABand": 2,
                    "UnitCode": "HSC1200",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to public health"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit is the second of the two units designed to familiarise health science students with the anatomical structures and physiological functions of the systems of the human body that underpin the regulatory mechanisms for homeostatic control. Students will be introduced to the structure and function of the cardiovascular, circulatory and respiratory systems together with their vital role in maintaining homeostasis. The key features of the lymphatic system and the properties of blood will be discussed. The unit will continue with a look at the importance of the endocrine system and its role in integrating various functions to control homeostasis. Students will be introduced to the key anatomical and physiological features of the urinary and digestive systems and the importance of maintaining pH and fluid balance within the body. Finally, students will be introduced to the reproductive systems, pregnancy and development. Throughout the unit, clinical connections will be made with the systems addressed so that students will understand the relevance of the topics included in the unit to the health and human science disciplines.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "BMA1011.",
                    "Prohibitions": "BMA1902, BMA1912",
                    "SCABand": 2,
                    "UnitCode": "BMA1012",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Foundations of anatomy and physiology for health practice 2"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit provides an introduction to the course of disease for common health conditions, and their impact on individuals and populations.The unit outlines different types of disease, and explores common diseases from pathophysiological, psychosocial, and epidemiological perspectives. The course of disease, and contributing and risk factors at the individual and social levels are explored, as well as the consequences for individuals, health systems, and society.Particular conditions considered will vary but will include diseases across the communicable, non-communicable, acute, chronic and degenerative conditions.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "HSC1300",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Human health and disease"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit will deliver a structured introduction to the Australian healthcare system. Students will gain a preliminary knowledge of the organization, current policies and policy debates, funding arrangements and emerging trends in healthcare practice. A feature of the unit is an inclusive approach to the understanding of health. This approach will consider aged care, disability, mental health, and alcohol and drug components in addition to established health services. Case studies will be used to consolidate the theoretical material. Students will develop a reflective understanding of their own experience of health care, and  be able to identify their assumptions regarding health and the practice of health care. Overarching themes will include an overview of the health system, specialist sectors and working in the health space.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "BME3032, HSC1052, PHH1052.",
                    "SCABand": 2,
                    "UnitCode": "HSC1400",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "The Australian healthcare system"
                }
            ],
            "year": 2016
        },
        {
            "code": "S1-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit explores key emerging challenges in health at the national and global levels. A case study approach is used to explore current issues facing health systems, including the causes, consequences, and approaches used to address the issues.Causes are considered at the behavioural, social, cultural, political and environmental levels. A public health and/or systems thinking perspective is taken to describe and critically appraise initiatives to address identified issues.Specific challenges which will be the focus of this unit will change over time in line with contemporary and emerging issues, but for example may include: obesity, population ageing, climate change, emerging infectious diseases and mental health, terrorism, and natural disasters.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "One of (HSC1200, HSC1081, PHH1081).",
                    "Prohibitions": "HSC3011.",
                    "SCABand": 2,
                    "UnitCode": "HSC2100",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Emerging challenges in health"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit uses the framework of human development to examine health throughout the lifespan. Physical, cognitive, emotional, behavioural and psychosocial development, and the impact of culture on health will be examined. Students will investigate the roles of allied health professionals in assessing and maintaining health across the lifespan.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "BMA1012 and HSC1300",
                    "Prohibitions": "BEH1041, NUT2001.",
                    "SCABand": 2,
                    "UnitCode": "HSC2200",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Health and the human lifespan"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to the contemporary frameworks and strategies that are used to prevent disease and promote health at the population level. Students will examine methods for primary, secondary and tertiary prevention undertaken through health agencies, and develop an understanding of the role of different health professions in this work. Disease prevention methods investigated will include behavioural education and counselling, vaccination and pharmacological interventions, health screening, chronic disease self-management, and rehabilitation in health care and community settings. Health promotion will be introduced as an approach that uses multiple strategies to empower individuals and communities and create supportive environments for health. The health promotion actions examined will include policy development, community mobilisation, health education and social marketing. The role that partnerships and capacity building play in sustaining action and health outcomes will be investigated. Learning will be facilitated with case examples and consideration will be given to how the methods examined can be applied to current public health priorities.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "One of (HSC1081, PHH1081, HSC1200).",
                    "Prohibitions": "HSC1072, HSC2101, PHH2101.",
                    "SCABand": 2,
                    "UnitCode": "HSC2300",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Health promotion and disease prevention"
                }
            ],
            "year": 2017
        },
        {
            "code": "S2-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to the applications of epidemiological concepts and methods to typical problems in population health and in the broader public health literature.This will include consideration of fundamental ethical issues pertaining to the conduct of public health research and population health interventions.Emphasis is placed on a population view of health and disease, social determinants of health, epidemiological principles, research study design and interpretation, and communication of evidence in practice.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "HSC2141, HSC2142",
                    "SCABand": 2,
                    "UnitCode": "PBH2001",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Foundations of epidemiology"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to the basic principles and methods used in biostatistics as applied to public health and clinical research.The key concepts covered include the technical qualifications necessary for analysing and interpreting data on a descriptive and bivariate level.The unit will cover topics which include classification of health data, sampling methods;, study design, summarizing data using simple statistical methods and graphical presentation, sampling distributions, quantifying uncertainty in results from a sample, statistical distributions (normal and t-distribution),  comparing two independent/paired groups using t-test (p-value) and confidence intervals, comparing more than two groups using Analysis of variance (ANOVA), non-parametric tests for comparing two or more groups when normality assumptions do not hold, assessing the association between an outcome and an exposure using the chi-squared test, and risk comparisons (RR & OR).",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "HSC2141",
                    "SCABand": 2,
                    "UnitCode": "PBH2002",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Foundations of biostatistics"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit will explore how individual and population experiences of health are shaped by culture and society.The unit draws on key sociological, anthropological, political and philosophical theories to reveal various relationships between health and the larger socio-cultural realities in which people live.Students will be encouraged to foster skills in critical deconstruction of Western representations of culture to arrive at an appreciation of various 'ways of knowing,' including Indigenous scholarship. Examples will be drawn from healthcare and economic systems in Australia and overseas.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "One of (HSC1081, HSC1200, HSC1112, PHH1081, PHH1112).",
                    "Prohibitions": "ATS2717, HSC2022, PHH2022",
                    "SCABand": 2,
                    "UnitCode": "PBH2003",
                    "UnitLocationTP": [
                        [
                            [
                                "Caulfield"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Culture, society and health"
                }
            ],
            "year": 2017
        },
        {},
        {}
    ]
}