{
    "courseAOS": "Medicine and Surgery (Graduate entry)",
    "courseCode": "M6018",
    "courseName": "Medical Science and Medicine",
    "courseType": "Bachelor degree/Master degree",
    "faculty": "Faculty of Medicine, Nursing and Health Sciences",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "GMA1010 Foundations of medical practice (48 points) GMA2000 Final grade (0 points)",
                    "UnitName": ""
                }
            ],
            "year": 0
        },
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 12,
                    "Description": "MED3051 is an integrated medicine/surgery curriculum based on the four themes of the medical curriculum: Personal and professional development; population, society, health and illness; foundations of medicine; and clinical skills. Evidence-based educational approaches support students in acquiring appropriate knowledge, attitudes and skills in medicine, surgery, clinical skills, evidence-based clinical practice, occupational and environmental medicine, pathophysiology, pharmacology, ethics and law. Previous learning will be extended.",
                    "EFTSL": 0.25,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "MED2031, MED2042 and MED2000 or GMA1010 and GMA2000.",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MED3051",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester (extended) 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester (extended) 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Medicine and surgery 1"
                },
                {
                    "CreditPoints": 24,
                    "Description": "Introductory Clinical Studies integrates the learning across MED3051 and MED3062. Learning activities specific to each specialty area will be linked to the specific clinical placement and may include lectures, tutorials, case-based learning,  bed- side tutorials, practical skills sessions, and specialty teaching clinics and  directed learning activities.",
                    "EFTSL": 0.5,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "Must have completed 2 of MED2031, MED2042, GMA1010, GMA2000.",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MED3200",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Full year (extended) 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "Full year (extended) 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introductory clinical studies"
                }
            ],
            "year": 1
        },
        {
            "code": "S2-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 12,
                    "Description": "MED3062 is an integrated medicine/surgery curriculum based on the four themes of the medical curriculum: personal and professional development; population, society, health and illness; foundations of medicine; and clinical skills. Evidence-based educational approaches support students in acquiring appropriate knowledge, attitudes and skills in medicine, surgery, clinical skills, evidence-based clinical practice, occupational and environmental medicine, patho-physiology, pharmacology, ethics and law. Previous learning will be extended. By the end of the semester students must be capable of undertaking history and clinical examinations of patients with straightforward conditions.",
                    "EFTSL": 0.25,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "Must have passed an (I/W) unit in {MED3051}.",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MED3062",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Second semester (extended) 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "Second semester (extended) 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Medicine and surgery 2"
                }
            ],
            "year": 1
        },
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 24,
                    "Description": "Specialty Clinical Practices provides clinical teaching in Children's Health, General Practice, Psychiatry and Women's Health. Students will undertake clinical placements in at least 2 specialty areas across the semester. Learning activities, tailored to the specific placement, may include lectures, tutorials, case-based learning, bedside tutorials, practical skills sessions, and specialty teaching clinics and directed learning activities. Students are expected to attend clinical settings, undertake independent learning activities and consolidate knowledge and skills from previous learning. EBCP and Health Economics components will be integrated with placement activities.",
                    "EFTSL": 0.5,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "MED3051, MED3062 and MED3200 or GMB3031, GMB3042 and GMB3200.",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MED4190",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Full year (extended) 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "Full year (extended) 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Specialty clinical practices"
                },
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "MED4200 Integrated clinical studies (24 points) MED4000 Year 3B and 4C final grade (0 points)",
                    "UnitName": ""
                }
            ],
            "year": 2
        },
        {
            "code": "S1-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 18,
                    "Description": "MED5091 is focused on facilitating the transition of students into the medical workplace as beginning interns. Students will participate in a range of learning experiences which are designed to substantially enhance their clinical reasoning, diagnostic and case management skills. Students will participate in supervised clinical practice and related learning activities (learning modules). Furthermore, students will have the opportunity to broaden their knowledge and skills in self selected areas of clinical practice which may include electing a remote community, health or medicine related field.",
                    "EFTSL": 0.375,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "MED4000, MED4190 and MED4200.",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MED5091",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester (extended) 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester (extended) 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Advanced clinical practice 1"
                },
                {
                    "CreditPoints": 6,
                    "Description": "Medical practitioners are frequently required to respond to emerging and consolidating innovations and policies related to clinical practice. MED5102 further develops the concept of 'readiness to practice' and focuses upon the development of students' understanding of the principles of Patient Safety and the related clinical competencies. The unit will provide students with an understanding of the role of research in Patient Safety and the application of these principles and practices in diverse contexts. The unit will have the capacity to respond to other issues/innovations/policy changes as they arise in medical practice.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Medicine, Nursing and Health Sciences",
                    "Prerequisites": "2012 pre-reqs: MED4071, MED4082 and MED40002014 pre-reqs: MED4171, MED4182, MED4200 and MED4000 or GMC4151, GMC4162, GMC4200 and GMC4000.",
                    "Prohibitions": "",
                    "SCABand": 3,
                    "UnitCode": "MED5102",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "Full year (extended) 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "Full year (extended) 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Contemporary developments in clinical practice: Patient safety"
                }
            ],
            "year": 3
        },
        {
            "code": "S2-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 0,
                    "Faculty": "",
                    "SCABand": 0,
                    "UnitCode": "MED5092 Advanced clinical practice 2 (12 points) MED5100 Final MBBS grade (0 points)",
                    "UnitName": ""
                }
            ],
            "year": 3
        }
    ]
}