{
    "courseCode": "P6001",
    "courseName": "Pharmacy",
    "courseType": "Bachelor degree/Master degree",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 3,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit introduces students to the role of the pharmacist and health care services relating to consumers and their medicines. It introduces important aspects of human behaviour and cultural considerations, with a focus on enhancing professional communication with health care consumers and healthcare professionals. Students will learn the fundamentals of dispensing prescriptions and medication counselling. Each student will build a portfolio to instil lifelong learning attributes and develop a personalised learning plan to advance their cognitive and non-cognitive skills.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Pharmacy and Pharmaceutical Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "PHR1011",
                    "UnitLocationTP": [
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Parkville"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Professional Practice I"
                },
                {
                    "CreditPoints": 6,
                    "Description": "This unit provides an introduction to how drugs become medicines and explores factors that influence the absorption of drugs following oral administration. Students will study the physicochemical properties of molecules that determine dissolution, solubility, stability and permeability in order to explain how these factors affect oral drug absorption. In addition, the barrier properties of the small intestine, and how they contribute to, or limit, the oral absorption of drugs will be discussed as well as the formulation properties of commonly-administered oral formulations (tablets and capsules).",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Pharmacy and Pharmaceutical Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "PHR1021",
                    "UnitLocationTP": [
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Parkville"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "How Medicines Work I"
                },
                {
                    "CreditPoints": 12,
                    "Description": "This unit will provide students with the foundational understanding and knowledge of the human body, including how cells, molecules and organs ensure proper functioning of the body.  This will include studies of anatomy, physiology and biochemistry relevant to pharmacists.  Students will be able to predict the outcome of cell and organ dysfunction, as well as effectively communicate aspects of how the body works.",
                    "EFTSL": 0.25,
                    "Faculty": "Faculty of Pharmacy and Pharmaceutical Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "PHR1031",
                    "UnitLocationTP": [
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Parkville"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "How the Body Works"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 2,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit builds on students' understanding of the role of the pharmacist in providing healthcare services to different patient groups. Students will develop essential skills for pharmacy practice including furthering communication skills and mastering fundamental pharmaceutical calculations. Students will learn about and develop skills in professionalism, mindfulness and cultural sensitivity to support best pharmacy practice. There is a focus on the main priorities for health in Australia and the epidemiology of different patient groups. Each student will build on their portfolio to further instil lifelong learning attributes and continue to develop their personalised learning plan to advance cognitive and non-cognitive skills.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Pharmacy and Pharmaceutical Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "PHR1012",
                    "UnitLocationTP": [
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Parkville"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Professional Practice II"
                },
                {
                    "CreditPoints": 18,
                    "Description": "This unit builds upon PHR1021 to provide an overview of how drugs interact with their target once they have been absorbed into the bloodstream and the processes that occur in the body to remove the drug. To address these key areas, students will study the fundamentals of medicinal chemistry and pharmacology, with an emphasis on structure-activity relationships, drug-target interactions and the mechanism of action of medicines. Students will explore the concepts of drug clearance and volume of distribution, and how these impact on the secondary pharmacokinetic parameters which ultimately lead to the design of safe and effective therapeutic dosage regimens.",
                    "EFTSL": 0.375,
                    "Faculty": "Faculty of Pharmacy and Pharmaceutical Sciences",
                    "Prerequisites": "",
                    "Prohibitions": "",
                    "SCABand": 2,
                    "UnitCode": "PHR1022",
                    "UnitLocationTP": [
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Parkville"
                            ],
                            [
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "How Medicines Work II"
                }
            ],
            "year": 2016
        },
        {},
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}