{
    "courseCode": "S2000",
    "courseName": "Science",
    "courseType": "Bachelor degree",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Scientific method. The role of mathematical models in science. Principles of experimental and sampling design, data acquisition, analysis and presentation of data. Hypothesis testing and confidence intervals. Relationship between quantitative variables. Communication of scientific information.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Science",
                    "Prerequisites": "",
                    "Prohibitions": "STA1010, ETC1000, ETW1000, ETW1102, ETX1100, FIT1006, MTH1030. Note that SCI1020 is an introductory unit and students who have already completed one of these prohibited units cannot subsequently enrol in SCI1020. Students who have completed MTH1030 should enrol in STA1010 instead.",
                    "SCABand": 2,
                    "UnitCode": "SCI1020",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "Second semester 2017 (Day)",
                                "October intake 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Introduction to statistical reasoning"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2016
        },
        {
            "code": "S1-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Science and technology are the basis of modern life yet most people do not understand how discoveries are made or commercialised. In SCI2010 you will examine the core elements of modern science by looking back at the people, cultures, events and discoveries that allowed science to emerge and contributed to the establishment of key concepts such as empiricism, scepticism and rationalism. This unit will equip you with skills to assess the validity of scientific information, to distinguish between real science, bad science and pseudoscience. The value of science in solving real world issues, and improving the human condition are discussed using current examples. Students will benefit from critical evaluation of a wide variety of literature, ranging from peer-reviewed scientific publications to web sites promulgating pseudoscientific remedies. These skills will help your analysis and communication of science and other disciplines. You will complete assignments that will help improve your written and verbal communication to a range of audiences including politicians, managers, the general public and your fellow educated specialists. You will uncover and strengthen your own personal and professional ethical standpoint on current issues such as vaccines, the funding of research by multi-national corporations and plagiarism. Together the topics covered in SCI2010 give you a solid foundation on which to forge a professional career whether it is directly related to science or not.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Science",
                    "Prerequisites": "Two semesters of first year university",
                    "Prohibitions": "SCI2015",
                    "SCABand": 2,
                    "UnitCode": "SCI2010",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Scientific practice and communication"
                }
            ],
            "year": 2017
        },
        {
            "code": "S2-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2017
        },
        {
            "code": "S1-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2018
        },
        {
            "code": "S2-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2018
        }
    ]
}