{
    "courseCode": "S3002",
    "courseName": "Science Advanced - Research",
    "courseType": "Bachelor degree (honours)",
    "teachingPeriods": [
        {
            "code": "S1-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "Descriptive statistics, scatter plots, correlation, line of best fit. Elementary probability theory. Confidence intervals and hypothesis tests using normal, t and binomial distributions. Use of computer software. Formal treatment of statistical analyses and the role of probability in statistical inference.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Science",
                    "Prerequisites": "SCI1020, VCE Mathematical methods 3 and 4, or equivalent international qualifications listed in the Unit Guide.",
                    "Prohibitions": "ETC1000, ETW1000, ETW1102, ETX1100, FIT1006 and MAT1097.Note: students who have completed STA1010 cannot subsequently undertake SCI1020.",
                    "SCABand": 2,
                    "UnitCode": "STA1010",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ],
                        [
                            [
                                "Malaysia"
                            ],
                            [
                                "First semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Statistical methods for science"
                }
            ],
            "year": 2016
        },
        {
            "code": "S2-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2016
        },
        {
            "code": "S1-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2017
        },
        {
            "code": "S2-01",
            "numberOfUnits": 1,
            "units": [
                {
                    "CreditPoints": 6,
                    "Description": "This unit prepares students for scientific research by providing practical and theoretical training in planning, undertaking and documenting scientific research projects. Students will examine the core elements of modern science by looking back at the people, cultures, events and discoveries that allowed science to emerge and contribute to the establishment of key concepts such as empiricism, scepticism and rationalism. This unit will equip students with skills to assess the validity of scientific information, to distinguish between real science, bad science and pseudoscience.  The value of science in solving real world issues and improving the human condition are discussed using current examples. Students are exposed to recent advances in current and emerging research areas through journal presentations. Students will complete assignments that will help improve their written and verbal communication to a range of audiences including scientists, politicians, granting agencies, the general public and scientifically literate generalists, and identifies pathways to becoming a scientific researcher. Students are encouraged to submit their scientific literature reviews for publication in Reinvention, a Journal for Undergraduate Research.",
                    "EFTSL": 0.125,
                    "Faculty": "Faculty of Science",
                    "Prerequisites": "Enrolment in Bachelor of Science Advanced (Research). Students in other courses with two semesters of first year university study (48 credit points), with a minimum of a Distinction average (70%) across 24 points of science units, are also eligible to apply.",
                    "Prohibitions": "SCI2010",
                    "SCABand": 2,
                    "UnitCode": "SCI2015",
                    "UnitLocationTP": [
                        [
                            [
                                "Clayton"
                            ],
                            [
                                "First semester 2017 (Day)",
                                "Second semester 2017 (Day)"
                            ]
                        ]
                    ],
                    "UnitName": "Scientific practice and communication (advanced)"
                }
            ],
            "year": 2017
        },
        {
            "code": "S1-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2018
        },
        {
            "code": "S2-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2018
        },
        {
            "code": "S1-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2019
        },
        {
            "code": "S2-01",
            "numberOfUnits": 0,
            "units": [],
            "year": 2019
        }
    ]
}